michaelthomasj/fsp_cmake/ra6m5_gcc_secure/ra/fsp/src/r_flash_hp/r_flash_hp.c
/*
* Copyright (c) 2020 - 2026 Renesas Electronics Corporation and/or its affiliates
*
* SPDX-License-Identifier: BSD-3-Clause
*/

/***********************************************************************************************************************
 * Includes
 **********************************************************************************************************************/
#include "bsp_api.h"
#include <string.h>
#include "r_flash_hp.h"

/* Configuration for this package. */
#include "r_flash_hp_cfg.h"

/***********************************************************************************************************************
 * Typedef definitions
 **********************************************************************************************************************/

#if defined(__ARMCC_VERSION) || defined(__ICCARM__)
typedef void (BSP_CMSE_NONSECURE_CALL * flash_hp_prv_ns_callback)(flash_callback_args_t * p_args);
#elif defined(__GNUC__)
typedef BSP_CMSE_NONSECURE_CALL void (*volatile flash_hp_prv_ns_callback)(flash_callback_args_t * p_args);
#endif

/***********************************************************************************************************************
 * Macro definitions
 **********************************************************************************************************************/

#define FLASH_HP_FENTRYR_PE_MODE_BITS                 (0x0081U)
#define FLASH_HP_FSTATR_FLWEERR                       (1U << 6U)
#define FLASH_HP_FSTATR_PRGERR                        (1U << 12U)
#define FLASH_HP_FSTATR_ERSERR                        (1U << 13U)
#define FLASH_HP_FSTATR_ILGLERR                       (1U << 14U)
#define FLASH_HP_FSTATR_OTERR                         (1U << 20U)
#define FLASH_HP_FSTATR_SECERR                        (1U << 21U)
#define FLASH_HP_FSTATR_FESETERR                      (1U << 22U)
#define FLASH_HP_FSTATR_ILGCOMERR                     (1U << 23U)

#define FLASH_HP_FSTATR_ERROR_MASK                    (FLASH_HP_FSTATR_FLWEERR | FLASH_HP_FSTATR_PRGERR | \
                                                       FLASH_HP_FSTATR_ERSERR |                           \
                                                       FLASH_HP_FSTATR_ILGLERR | FLASH_HP_FSTATR_OTERR |  \
                                                       FLASH_HP_FSTATR_SECERR |                           \
                                                       FLASH_HP_FSTATR_FESETERR | FLASH_HP_FSTATR_ILGCOMERR)

/** "OPEN" in ASCII, used to avoid multiple open. */
#define FLASH_HP_OPEN                                 (0x4f50454eU)
#define FLASH_HP_CLOSE                                (0U)

/* Minimum FCLK for Flash Operations in Hz */
#define FLASH_HP_MINIMUM_SUPPORTED_FCLK_FREQ          (4000000U)

/** The maximum timeout for commands is 100usec when FCLK is 16 MHz i.e. 1600 FCLK cycles.
 * Assuming worst case of ICLK at 240 MHz and FCLK at 4 MHz, and optimization set to max such that
 * each count decrement loop takes only 5 cycles, then ((240/4)*1600)/5 = 19200 */
#define FLASH_HP_FRDY_CMD_TIMEOUT                     (19200)

/** Time that it would take for the Data Buffer to be empty (DBFULL Flag) is 90 FCLK cycles.
 * Assuming worst case of ICLK at 240 MHz and FCLK at 4 MHz, and optimization set to max such that
 * each count decrement loop takes only 5 cycles, then ((240/4)*90)/5 = 1080 */
#define FLASH_HP_DBFULL_TIMEOUT                       (1080U)

/** R_FACI Commands */
#define FLASH_HP_FACI_CMD_PROGRAM                     (0xE8U)
#define FLASH_HP_FACI_CMD_PROGRAM_CF                  (0x80U)
#define FLASH_HP_FACI_CMD_PROGRAM_DF                  (0x02U)
#define FLASH_HP_FACI_CMD_BLOCK_ERASE                 (0x20U)
#define FLASH_HP_FACI_CMD_PE_SUSPEND                  (0xB0U)
#define FLASH_HP_FACI_CMD_PE_RESUME                   (0xD0U)
#define FLASH_HP_FACI_CMD_STATUS_CLEAR                (0x50U)
#define FLASH_HP_FACI_CMD_FORCED_STOP                 (0xB3U)
#define FLASH_HP_FACI_CMD_BLANK_CHECK                 (0x71U)
#define FLASH_HP_FACI_CMD_CONFIG_SET_1                (0x40U)
#define FLASH_HP_FACI_CMD_CONFIG_SET_2_CF             (0x08U)
#define FLASH_HP_FACI_CMD_CONFIG_SET_2_DF             (0x02U)
#define FLASH_HP_FACI_CMD_LOCK_BIT_PGM                (0x77U)
#define FLASH_HP_FACI_CMD_LOCK_BIT_READ               (0x71U)
#define FLASH_HP_FACI_CMD_INCREMENT_COUNTER           (0x35U)
#define FLASH_HP_FACI_CMD_REFRESH_COUNTER             (0x37U)
#define FLASH_HP_FACI_CMD_READ_COUNTER                (0x39U)
#define FLASH_HP_FACI_CMD_FINAL                       (0xD0U)

#if (BSP_CFG_MCU_PART_SERIES == 8)
 #define FLASH_HP_FCU_CONFIG_SET_DUAL_MODE            (0x0300A110U)
 #define FLASH_HP_FCU_CONFIG_SET_ACCESS_STARTUP       (0x0300A130U)
 #define FLASH_HP_FCU_CONFIG_SET_BANK_MODE            (0x1300A190U)
 #define FLASH_HP_FCU_CONFIG_SET_BANK_MODE_SEC        (0x0300A210U)
 #define FLASH_HP_BANK_MODE_SECURITY_ATTRIBUTION      (0x0300A290U)
#else
 #if BSP_FEATURE_FLASH_SUPPORTS_ACCESS_WINDOW
  #define FLASH_HP_FCU_CONFIG_SET_ACCESS_STARTUP      (0x0000A160U)
  #define FLASH_HP_FCU_CONFIG_SET_ID_BYTE             (0x0000A150U)
 #else
  #define FLASH_HP_FCU_CONFIG_SET_ACCESS_STARTUP      (0x0100A130U)
  #define FLASH_HP_FCU_CONFIG_SET_ID_BYTE             (0x0000A120U)
 #endif
 #define FLASH_HP_FCU_CONFIG_SET_DUAL_MODE            (0x0100A110U)
 #define FLASH_HP_FCU_CONFIG_SET_BANK_MODE            (0x0100A190U)
 #define FLASH_HP_FCU_CONFIG_SET_BANK_MODE_SEC        (0x0100A210U)
 #define FLASH_HP_BANK_MODE_SECURITY_ATTRIBUTION      (0x0100A290U)
#endif

/* Zero based offset into g_configuration_area_data[] for FAWS */
#define FLASH_HP_FCU_CONFIG_SET_FAWS_OFFSET           (2U)

/* Zero based offset into g_configuration_area_data[] for FAWE and BTFLG */
#define FLASH_HP_FCU_CONFIG_SET_FAWE_BTFLG_OFFSET     (3U)

/* These bits must always be set when writing to the configuration area. */
#define FLASH_HP_FCU_CONFIG_FAWE_BTFLG_UNUSED_BITS    (0x7800U)
#define FLASH_HP_FCU_CONFIG_FAWS_UNUSED_BITS          (0xF800U)

/* 8 words need to be written for code flash */
#define FLASH_HP_CONFIG_SET_ACCESS_WORD_CNT_CF        (8U)

