michaelthomasj/fsp_cmake/ra6m5_gcc_secure/ra/fsp/src/r_flash_hp/r_flash_hp.c
/* 2 words need to be written for data flash */
#define FLASH_HP_CONFIG_SET_ACCESS_WORD_CNT_DF        (2U)

#define FLASH_HP_FSUACR_KEY                           (0x6600U)

/** Register masks */
#define FLASH_HP_FPESTAT_NON_LOCK_BIT_PGM_ERROR       (0x0002U) // Bits indicating Non Lock Bit related Programming error.
#define FLASH_HP_FPESTAT_NON_LOCK_BIT_ERASE_ERROR     (0x0012U) // Bits indicating Non Lock Bit related Erasure error.
#define FLASH_HP_FENTRYR_DF_PE_MODE                   (0x0080U) // Bits indicating that Data Flash is in P/E mode.
#define FLASH_HP_FENTRYR_CF_PE_MODE                   (0x0001U) // Bits indicating that CodeFlash is in P/E mode.
#define FLASH_HP_FENTRYR_TRANSITION_TO_CF_PE          (0xAA01U) // Key Code to transition to CF P/E mode.
#define FLASH_HP_FENTRYR_TRANSITION_TO_DF_PE          (0xAA80U) // Key Code to transition to DF P/E mode.

#define FLASH_HP_FREQUENCY_IN_HZ                      (1000000U)

#define FLASH_HP_FENTRYR_READ_MODE                    (0xAA00U)

#define FLASH_HP_FMEPROT_LOCK                         (0xD901)
#define FLASH_HP_FMEPROT_UNLOCK                       (0xD900)

#define FLASH_HP_OFS_SAS_MASK                         (0x7FFFU)

#define FLASH_HP_FAEINT_DFAEIE                        (0x08)
#define FLASH_HP_FAEINT_CMDLKIE                       (0x10)
#define FLASH_HP_FAEINT_CFAEIE                        (0x80)
#define FLASH_HP_ERROR_INTERRUPTS_ENABLE              (FLASH_HP_FAEINT_DFAEIE | FLASH_HP_FAEINT_CMDLKIE | \
                                                       FLASH_HP_FAEINT_CFAEIE)

#define FLASH_HP_FPCKAR_KEY                           (0x1E00U)

#define FLASH_HP_MAX_WRITE_CF_US                      (15800)
#define FLASH_HP_MAX_WRITE_DF_US                      (3800)
#define FLASH_HP_MAX_DBFULL_US                        (2)
#define FLASH_HP_MAX_BLANK_CHECK_US                   (84)
#define FLASH_HP_MAX_WRITE_CONFIG_US                  (512000)
#define FLASH_HP_MAX_ERASE_DF_BLOCK_US                (18000)
#define FLASH_HP_MAX_ERASE_CF_LARGE_BLOCK_US          (1040000)
#define FLASH_HP_MAX_ERASE_CF_SMALL_BLOCK_US          (260000)
#define FLASH_HP_MAX_INCREMENT_REFRESH_COUNTER_US     (81000)
#define FLASH_HP_MAX_READ_COUNTER_US                  (25)

#define FLASH_HP_FASTAT_DFAE                          (0x08)
#define FLASH_HP_FASTAT_CFAE                          (0x80)
#define FLASH_HP_FASTAT_CMDLK                         (0x10)

#define FLASH_HP_WAIT_TDSTOP                          (250U)
#define FLASH_HP_DELAY_LOOP_CYCLES                    (4U)
#define FLASH_HP_DELAY_NS_PER_US                      (1000U)

#if BSP_FEATURE_FLASH_HP_SUPPORTS_DUAL_BANK
 #define FLASH_HP_PRV_DUALSEL_BANKMD_MASK             (0x7U)
 #define FLASH_HP_PRV_BANKSEL_BANKSWP_MASK            (0x7U)
 #define FLASH_HP_PRV_BANK1_MASK                      (~BSP_FEATURE_FLASH_HP_CF_DUAL_BANK_START)
#else
 #define FLASH_HP_PRV_BANK1_MASK                      (UINT32_MAX)
#endif

#define FLASH_HP_PRV_ARCNS_SINGLE                     (1) // ARCNS setting for single ARC_NSEC counter
#define FLASH_HP_PRV_ARCNS_MULTIPLE                   (0) // ARCNS setting for multiple ARC_NSEC counters
#define FLASH_HP_PRV_ARC_OEMBL_FCNTSELR               (2)
#define FLASH_HP_PRV_ARC_SEC_FCNTSELR                 (1)
#define FLASH_HP_PRV_ARC_NSEC_0_FCNTSELR              (4)
#define FLASH_HP_PRV_64_BITS                          (64U)

/* flash_hp_configuration_area_write needs to be in RAM only when code flash programming is enabled */
#if (FLASH_HP_CFG_CODE_FLASH_PROGRAMMING_ENABLE == 1)
 #define FLASH_HP_CONFIG_AREA_WRITE_SECTION           PLACE_IN_RAM_SECTION
#else
 #define FLASH_HP_CONFIG_AREA_WRITE_SECTION
#endif

/* The number of CPU cycles per each timeout loop. */
#ifndef R_FLASH_HP_CYCLES_MINIMUM_PER_TIMEOUT_LOOP
 #if defined(__GNUC__)
  #define R_FLASH_HP_CYCLES_MINIMUM_PER_TIMEOUT_LOOP    (6U)
 #elif defined(__ICCARM__)
  #define R_FLASH_HP_CYCLES_MINIMUM_PER_TIMEOUT_LOOP    (6U)
 #endif
#endif

#define FLASH_HP_REGISTER_WAIT_TIMEOUT(val, reg, timeout, err) \
    while (val != reg)                                         \
    {                                                          \
        if (0 == timeout)                                      \
        {                                                      \
            return err;                                        \
        }                                                      \
        timeout--;                                             \
    }

/***********************************************************************************************************************
 * Private global variables
 **********************************************************************************************************************/
#if (FLASH_HP_CFG_CODE_FLASH_PROGRAMMING_ENABLE == 1)
static uint16_t g_configuration_area_data[FLASH_HP_CONFIG_SET_ACCESS_WORD_CNT_CF] = {UINT16_MAX};
#endif

#define FLASH_HP_DF_START_ADDRESS    (BSP_FEATURE_FLASH_DATA_FLASH_START)
#define FLASH_HP_DF_NUM_REGIONS      ((BSP_FEATURE_FLASH_USER_LOCKABLE_AREA_SIZE > 0) ? 2 : 1)

static const flash_block_info_t g_code_flash_macro_info[] =
{
    {
        .block_section_st_addr  = 0,
        .block_section_end_addr = UINT16_MAX,
        .block_size             = BSP_FEATURE_FLASH_HP_CF_REGION0_BLOCK_SIZE,
        .block_size_write       = BSP_FEATURE_FLASH_HP_CF_WRITE_SIZE
    },
    {
        .block_section_st_addr  = BSP_FEATURE_FLASH_HP_CF_REGION0_SIZE,
        .block_section_end_addr = BSP_ROM_SIZE_BYTES - 1,
        .block_size             = BSP_FEATURE_FLASH_HP_CF_REGION1_BLOCK_SIZE,
        .block_size_write       = BSP_FEATURE_FLASH_HP_CF_WRITE_SIZE
    }
};

static const flash_regions_t g_flash_code_region =
{
    .num_regions   = 2,
    .p_block_array = g_code_flash_macro_info
};

const flash_block_info_t g_data_flash_macro_info[] =
{
    {
        .block_section_st_addr  = FLASH_HP_DF_START_ADDRESS,
        .block_section_end_addr = FLASH_HP_DF_START_ADDRESS + BSP_DATA_FLASH_SIZE_BYTES - 1,
        .block_size             = BSP_FEATURE_FLASH_HP_DF_BLOCK_SIZE,
        .block_size_write       = BSP_FEATURE_FLASH_HP_DF_WRITE_SIZE
    },
#if FLASH_HP_DF_NUM_REGIONS > 1
    {
        .block_section_st_addr  = BSP_FEATURE_FLASH_USER_LOCKABLE_AREA_START,
        .block_section_end_addr = BSP_FEATURE_FLASH_USER_LOCKABLE_AREA_START +
                                  BSP_FEATURE_FLASH_USER_LOCKABLE_AREA_SIZE - 1,
        .block_size       = 1,
        .block_size_write = BSP_FEATURE_FLASH_HP_DF_WRITE_SIZE
    },
#endif
};

