michaelthomasj/fsp_cmake/ra6m5_gcc_secure/ra/fsp/src/r_flash_hp/r_flash_hp.c
static flash_regions_t g_flash_data_region =
{
    .num_regions   = FLASH_HP_DF_NUM_REGIONS,
    .p_block_array = g_data_flash_macro_info
};

#if (FLASH_HP_CFG_CODE_FLASH_PROGRAMMING_ENABLE == 1) && (BSP_FEATURE_FLASH_HP_SUPPORTS_DUAL_BANK == 1) && \
    (FLASH_HP_CFG_PARAM_CHECKING_ENABLE == 1)
static volatile uint32_t * const flash_hp_dualsel = (uint32_t *) FLASH_HP_FCU_CONFIG_SET_DUAL_MODE;
#endif

/***********************************************************************************************************************
 * Private function prototypes
 **********************************************************************************************************************/

void fcu_fiferr_isr(void);
void fcu_frdyi_isr(void);

/* Internal functions. */
static fsp_err_t flash_hp_init(flash_hp_instance_ctrl_t * p_ctrl);

#if BSP_FEATURE_FLASH_HP_VERSION == 4
static void r_flash_hp_delay_ns(uint32_t ns, uint32_t mhz) PLACE_IN_RAM_SECTION __attribute__((noinline));

#endif
static fsp_err_t flash_hp_enter_pe_df_mode(flash_hp_instance_ctrl_t * const p_ctrl);

static fsp_err_t flash_hp_pe_mode_exit() PLACE_IN_RAM_SECTION;

static fsp_err_t flash_hp_reset(flash_hp_instance_ctrl_t * p_ctrl) PLACE_IN_RAM_SECTION;

static fsp_err_t flash_hp_stop(void) PLACE_IN_RAM_SECTION;

static fsp_err_t flash_hp_status_clear() PLACE_IN_RAM_SECTION;

static fsp_err_t flash_hp_erase_block(flash_hp_instance_ctrl_t * const p_ctrl, uint32_t block_size,
                                      uint32_t timeout) PLACE_IN_RAM_SECTION;

static fsp_err_t flash_hp_write_data(flash_hp_instance_ctrl_t * const p_ctrl, uint32_t write_size,
                                     uint32_t timeout) PLACE_IN_RAM_SECTION;

static fsp_err_t flash_hp_check_errors(fsp_err_t previous_error, uint32_t error_bits,
                                       fsp_err_t return_error) PLACE_IN_RAM_SECTION;

static void r_flash_hp_call_callback(flash_hp_instance_ctrl_t * p_ctrl, flash_event_t event);

#if (FLASH_HP_CFG_DATA_FLASH_PROGRAMMING_ENABLE == 1)

static fsp_err_t flash_hp_df_blank_check(flash_hp_instance_ctrl_t * const p_ctrl,
                                         uint32_t const                   address,
                                         uint32_t                         num_bytes,
                                         flash_result_t                 * p_blank_check_result);

static fsp_err_t flash_hp_df_write(flash_hp_instance_ctrl_t * const p_ctrl);

static fsp_err_t flash_hp_df_erase(flash_hp_instance_ctrl_t * p_ctrl, uint32_t block_address, uint32_t num_blocks);

#endif

#if (FLASH_HP_CFG_CODE_FLASH_PROGRAMMING_ENABLE == 1) || (((FLASH_HP_CFG_DATA_FLASH_PROGRAMMING_ENABLE == 1) && \
    (BSP_FEATURE_FLASH_USER_LOCKABLE_AREA_SIZE > 0)) == 1)
static fsp_err_t flash_hp_configuration_area_write(flash_hp_instance_ctrl_t * p_ctrl,
                                                   uint32_t                   fsaddr,
                                                   uint16_t                 * src_address)
FLASH_HP_CONFIG_AREA_WRITE_SECTION;

#endif

#if (FLASH_HP_CFG_CODE_FLASH_PROGRAMMING_ENABLE == 1)
static void flash_hp_configuration_area_data_setup(uint32_t btflg_swap, uint32_t start_addr,
                                                   uint32_t end_addr) PLACE_IN_RAM_SECTION;

static fsp_err_t flash_hp_cf_write(flash_hp_instance_ctrl_t * const p_ctrl) PLACE_IN_RAM_SECTION;

 #if (BSP_FEATURE_FLASH_HP_SUPPORTS_DUAL_BANK == 1)
static fsp_err_t flash_hp_bank_swap(flash_hp_instance_ctrl_t * const p_ctrl) PLACE_IN_RAM_SECTION;
static uint32_t  flash_hp_banksel_bankswp_addr_get(void);

 #endif

static fsp_err_t flash_hp_cf_erase(flash_hp_instance_ctrl_t * p_ctrl, uint32_t block_address,
                                   uint32_t num_blocks) PLACE_IN_RAM_SECTION;

static fsp_err_t flash_hp_enter_pe_cf_mode(flash_hp_instance_ctrl_t * const p_ctrl) PLACE_IN_RAM_SECTION;

static fsp_err_t flash_hp_access_window_set(flash_hp_instance_ctrl_t * p_ctrl,
                                            uint32_t const             start_addr,
                                            uint32_t const             end_addr) PLACE_IN_RAM_SECTION;

static fsp_err_t flash_hp_set_startup_area_boot(flash_hp_instance_ctrl_t * p_ctrl,
                                                flash_startup_area_swap_t  swap_type,
                                                bool                       is_temporary) PLACE_IN_RAM_SECTION;

 #if (BSP_FEATURE_FLASH_SUPPORTS_ID_CODE == 1)
static fsp_err_t flash_hp_set_id_code(flash_hp_instance_ctrl_t * p_ctrl,
                                      uint8_t const * const      p_id_code,
                                      flash_id_code_mode_t       mode) PLACE_IN_RAM_SECTION;

 #endif

#endif

#if (FLASH_HP_CFG_PARAM_CHECKING_ENABLE == 1)

static fsp_err_t r_flash_hp_common_parameter_checking(flash_hp_instance_ctrl_t * const p_ctrl);

static fsp_err_t r_flash_hp_write_bc_parameter_checking(flash_hp_instance_ctrl_t * const p_ctrl,
                                                        uint32_t                         flash_address,
                                                        uint32_t const                   num_bytes,
                                                        bool                             check_write);

#endif

#if (FLASH_HP_CFG_DATA_FLASH_PROGRAMMING_ENABLE == 1) && (BSP_FEATURE_FLASH_USER_LOCKABLE_AREA_SIZE > 0)
static fsp_err_t flash_hp_user_lockable_area_write(flash_hp_instance_ctrl_t * p_ctrl,
                                                   uint32_t const             src_address,
                                                   uint32_t                   flash_address,
                                                   uint32_t const             num_bytes);

#endif

#if (FLASH_HP_CFG_DATA_FLASH_PROGRAMMING_ENABLE == 1) && (BSP_FEATURE_FLASH_SUPPORTS_ANTI_ROLLBACK == 1)
static uint8_t   flash_hp_counter_to_fcntselr_convert(flash_arc_t counter);
static fsp_err_t flash_hp_arc_read(flash_hp_instance_ctrl_t * const p_ctrl, uint8_t fcntselr, uint32_t * const p_count);
static fsp_err_t flash_hp_arc_cmd_execute(flash_hp_instance_ctrl_t * const p_ctrl,
                                          uint8_t                          fcntselr,
                                          uint8_t                          cmd,
                                          volatile uint32_t                wait_count);

