michaelthomasj/fsp_cmake/ra6m5_gcc_secure/ra/fsp/src/r_flash_hp/r_flash_hp.c
 #if (FLASH_HP_CFG_PARAM_CHECKING_ENABLE == 1)
static fsp_err_t r_flash_hp_arc_common_parameter_checking(flash_hp_instance_ctrl_t * const p_ctrl,
                                                          flash_arc_t                      counter,
                                                          uint8_t                          fcntselr);

 #endif
#endif

/***********************************************************************************************************************
 * Exported global variables
 **********************************************************************************************************************/

const flash_api_t g_flash_on_flash_hp =
{
    .open                         = R_FLASH_HP_Open,
    .close                        = R_FLASH_HP_Close,
    .write                        = R_FLASH_HP_Write,
    .erase                        = R_FLASH_HP_Erase,
    .blankCheck                   = R_FLASH_HP_BlankCheck,
    .statusGet                    = R_FLASH_HP_StatusGet,
    .infoGet                      = R_FLASH_HP_InfoGet,
    .accessWindowSet              = R_FLASH_HP_AccessWindowSet,
    .accessWindowClear            = R_FLASH_HP_AccessWindowClear,
    .idCodeSet                    = R_FLASH_HP_IdCodeSet,
    .reset                        = R_FLASH_HP_Reset,
    .startupAreaSelect            = R_FLASH_HP_StartUpAreaSelect,
    .updateFlashClockFreq         = R_FLASH_HP_UpdateFlashClockFreq,
    .bankSwap                     = R_FLASH_HP_BankSwap,
    .callbackSet                  = R_FLASH_HP_CallbackSet,
    .antiRollbackCounterIncrement = R_FLASH_HP_AntiRollbackCounterIncrement,
    .antiRollbackCounterRefresh   = R_FLASH_HP_AntiRollbackCounterRefresh,
    .antiRollbackCounterRead      = R_FLASH_HP_AntiRollbackCounterRead,
    .userLockableAreaWrite        = R_FLASH_HP_UserLockableAreaWrite,
};

/*******************************************************************************************************************//**
 * @addtogroup FLASH_HP
 * @{
 **********************************************************************************************************************/

/***********************************************************************************************************************
 * Functions
 **********************************************************************************************************************/

/*******************************************************************************************************************//**
 * Initializes the high performance flash peripheral. Implements @ref flash_api_t::open.
 *
 * The Open function initializes the Flash.
 *
 * Example:
 * @snippet r_flash_hp_example.c R_FLASH_HP_Open
 *
 * @retval     FSP_SUCCESS               Initialization was successful and timer has started.
 * @retval     FSP_ERR_ALREADY_OPEN      The flash control block is already open.
 * @retval     FSP_ERR_ASSERTION         NULL provided for p_ctrl or p_cfg.
 * @retval     FSP_ERR_IRQ_BSP_DISABLED  Caller is requesting BGO but the Flash interrupts are not enabled.
 * @retval     FSP_ERR_FCLK              FCLK must be a minimum of 4 MHz for Flash operations.
 **********************************************************************************************************************/
fsp_err_t R_FLASH_HP_Open (flash_ctrl_t * const p_api_ctrl, flash_cfg_t const * const p_cfg)
{
    flash_hp_instance_ctrl_t * p_ctrl = (flash_hp_instance_ctrl_t *) p_api_ctrl;
    fsp_err_t err = FSP_SUCCESS;

#if (FLASH_HP_CFG_PARAM_CHECKING_ENABLE)

    /* If null pointers return error. */
    FSP_ASSERT(NULL != p_cfg);
    FSP_ASSERT(NULL != p_ctrl);

    /* If open return error. */
    FSP_ERROR_RETURN((FLASH_HP_OPEN != p_ctrl->opened), FSP_ERR_ALREADY_OPEN);

    /* Background operations for data flash are enabled but the flash interrupt is disabled. */
    if (p_cfg->data_flash_bgo)
    {
        FSP_ERROR_RETURN(p_cfg->irq >= (IRQn_Type) 0, FSP_ERR_IRQ_BSP_DISABLED);
        FSP_ERROR_RETURN(p_cfg->err_irq >= (IRQn_Type) 0, FSP_ERR_IRQ_BSP_DISABLED);
    }

    /* MF4 devices must have HOCO running and stable in order to program and erase flash. */
 #if BSP_FEATURE_FLASH_HP_VERSION == 4

    /* If HOCO is not operating, return error */
    FSP_ERROR_RETURN(0U == R_SYSTEM->HOCOCR_b.HCSTP, FSP_ERR_INVALID_STATE);

    /* If HOCO is not stable, return error */
    FSP_ERROR_RETURN(1U == R_SYSTEM->OSCSF_b.HOCOSF, FSP_ERR_INVALID_STATE);
 #endif
#endif

    /* Set the parameters struct based on the user supplied settings */
    p_ctrl->p_cfg = p_cfg;

    if (true == p_cfg->data_flash_bgo)
    {
        p_ctrl->p_callback        = p_cfg->p_callback;
        p_ctrl->p_context         = p_cfg->p_context;
        p_ctrl->p_callback_memory = NULL;

        /* Enable FCU interrupts. */
        R_FACI_HP->FRDYIE = 1U;
        R_BSP_IrqCfgEnable(p_cfg->irq, p_cfg->ipl, p_ctrl);

        /* Enable Error interrupts. */
        R_FACI_HP->FAEINT = FLASH_HP_ERROR_INTERRUPTS_ENABLE;
        R_BSP_IrqCfgEnable(p_cfg->err_irq, p_cfg->err_ipl, p_ctrl);
    }
    else
    {
        /* Disable Flash Rdy interrupt in the FLASH peripheral. */
        R_FACI_HP->FRDYIE = 0U;

        /* Disable Flash Error interrupt in the FLASH peripheral */
        R_FACI_HP->FAEINT = 0U;
    }

    /* Calculate timeout values. */
    err = flash_hp_init(p_ctrl);
    FSP_ERROR_RETURN(FSP_SUCCESS == err, err);

    /* If successful mark the control block as open. Otherwise release the hardware lock. */
    p_ctrl->opened = FLASH_HP_OPEN;

    return err;
}

/*******************************************************************************************************************//**
 * Writes to the specified Code or Data Flash memory area. Implements @ref flash_api_t::write.
 *
 * Example:
 * @snippet r_flash_hp_example.c R_FLASH_HP_Write
 *
 * @retval     FSP_SUCCESS              Operation successful. If BGO is enabled this means the operation was started
 *                                      successfully.
 * @retval     FSP_ERR_IN_USE           The Flash peripheral is busy with a prior on-going transaction.
 * @retval     FSP_ERR_NOT_OPEN         The Flash API is not Open.
 * @retval     FSP_ERR_CMD_LOCKED       FCU is in locked state, typically as a result of attempting to Write an area
 *                                      that is protected by an Access Window.
 * @retval     FSP_ERR_WRITE_FAILED     Status is indicating a Programming error for the requested operation. This may
 *                                      be returned if the requested Flash area is not blank.
 * @retval     FSP_ERR_TIMEOUT          Timed out waiting for FCU operation to complete.
 * @retval     FSP_ERR_INVALID_SIZE     Number of bytes provided was not a multiple of the programming size or exceeded
 *                                      the maximum range.
 * @retval     FSP_ERR_INVALID_ADDRESS  Invalid address was input or address not on programming boundary.
 * @retval     FSP_ERR_ASSERTION        NULL provided for p_ctrl.
 * @retval     FSP_ERR_PE_FAILURE       Failed to enter or exit P/E mode.
 **********************************************************************************************************************/
fsp_err_t R_FLASH_HP_Write (flash_ctrl_t * const p_api_ctrl,
                            uint32_t const       src_address,
                            uint32_t             flash_address,
                            uint32_t const       num_bytes)
{
    flash_hp_instance_ctrl_t * p_ctrl = (flash_hp_instance_ctrl_t *) p_api_ctrl;
    fsp_err_t err = FSP_SUCCESS;

