michaelthomasj/fsp_cmake/ra6m5_gcc_secure/ra/fsp/src/r_flash_hp/r_flash_hp.c
#if (FLASH_HP_CFG_PARAM_CHECKING_ENABLE == 1)

    /* Verify write parameters. If failure return error. */
    err = r_flash_hp_write_bc_parameter_checking(p_ctrl, flash_address & ~BSP_FEATURE_TZ_NS_OFFSET, num_bytes, true);
    FSP_ERROR_RETURN((err == FSP_SUCCESS), err);
#endif

    p_ctrl->operations_remaining = (num_bytes) >> 1; // Since two bytes will be written at a time
    p_ctrl->source_start_address = src_address;
    p_ctrl->dest_end_address     = flash_address;
    p_ctrl->current_operation    = FLASH_OPERATION_NON_BGO;

#if (FLASH_HP_CFG_CODE_FLASH_PROGRAMMING_ENABLE == 1)
    if ((flash_address & ~BSP_FEATURE_TZ_NS_OFFSET) < BSP_FEATURE_FLASH_DATA_FLASH_START)
    {
 #if (FLASH_HP_CFG_PARAM_CHECKING_ENABLE == 1)

        /* Verify the source address is not in code flash. It will not be available in P/E mode. */
        FSP_ASSERT(src_address > BSP_ROM_SIZE_BYTES);
 #endif

        /* Initiate the write operation, may return FSP_ERR_IN_USE via setup_for_pe_mode() */
        err = flash_hp_cf_write(p_ctrl);
    }
    else
#endif
    {
#if (FLASH_HP_CFG_DATA_FLASH_PROGRAMMING_ENABLE == 1)
 #if (BSP_FEATURE_FLASH_HP_DF_WRITE_SIZE == 1)
        p_ctrl->operations_remaining = num_bytes; // Since one byte will be written at a time
 #endif

        /* Initiate the write operation, may return FSP_ERR_IN_USE via setup_for_pe_mode() */
        err = flash_hp_df_write(p_ctrl);
#endif
    }

    return err;
}

/*******************************************************************************************************************//**
 * Erases the specified Code or Data Flash blocks. Implements @ref flash_api_t::erase by the block_erase_address.
 *
 * @note       Code flash may contain blocks of different sizes. When erasing code flash it is important to take this
 *             into consideration to prevent erasing a larger address space than desired.
 *
 * Example:
 * @snippet r_flash_hp_example.c R_FLASH_HP_Erase
 *
 * @retval     FSP_SUCCESS              Successful open.
 * @retval     FSP_ERR_INVALID_BLOCKS   Invalid number of blocks specified
 * @retval     FSP_ERR_INVALID_ADDRESS  Invalid address specified. If the address is in code flash then code flash
 *                                      programming must be enabled.
 * @retval     FSP_ERR_IN_USE           Other flash operation in progress, or API not initialized
 * @retval     FSP_ERR_CMD_LOCKED       FCU is in locked state, typically as a result of attempting to Erase an area
 *                                      that is protected by an Access Window.
 * @retval     FSP_ERR_ASSERTION        NULL provided for p_ctrl
 * @retval     FSP_ERR_NOT_OPEN         The Flash API is not Open.
 * @retval     FSP_ERR_ERASE_FAILED     Status is indicating a Erase error.
 * @retval     FSP_ERR_TIMEOUT          Timed out waiting for the FCU to become ready.
 * @retval     FSP_ERR_PE_FAILURE       Failed to enter or exit P/E mode.
 **********************************************************************************************************************/
fsp_err_t R_FLASH_HP_Erase (flash_ctrl_t * const p_api_ctrl, uint32_t const address, uint32_t const num_blocks)
{
    flash_hp_instance_ctrl_t * p_ctrl = (flash_hp_instance_ctrl_t *) p_api_ctrl;
    fsp_err_t err = FSP_SUCCESS;

#if (FLASH_HP_CFG_PARAM_CHECKING_ENABLE == 1)

    /* Verify the control block is not null and is opened. */
    err = r_flash_hp_common_parameter_checking(p_ctrl);
    FSP_ERROR_RETURN(FSP_SUCCESS == err, err);

    if (true == p_ctrl->p_cfg->data_flash_bgo)
    {
        FSP_ASSERT(NULL != p_ctrl->p_callback);
    }

    /* If invalid number of blocks return error. */
    FSP_ERROR_RETURN(num_blocks != 0U, FSP_ERR_INVALID_BLOCKS);
#endif

    p_ctrl->current_operation = FLASH_OPERATION_NON_BGO;

#if (FLASH_HP_CFG_CODE_FLASH_PROGRAMMING_ENABLE == 1)
    if ((address & ~BSP_FEATURE_TZ_NS_OFFSET) < BSP_FEATURE_FLASH_DATA_FLASH_START)
    {
        uint32_t start_address = 0;
 #if (FLASH_HP_CFG_PARAM_CHECKING_ENABLE == 1)
        uint32_t region0_blocks = 0;
 #endif

 #if BSP_FEATURE_FLASH_CODE_FLASH_START != 0
        FSP_ERROR_RETURN(BSP_FEATURE_FLASH_CODE_FLASH_START <= (address & ~BSP_FEATURE_TZ_NS_OFFSET),
                         FSP_ERR_INVALID_ADDRESS);
 #endif

        /* Configure the current parameters based on if the operation is for code flash or data flash. */
        if ((((address & ~BSP_FEATURE_TZ_NS_OFFSET)) & FLASH_HP_PRV_BANK1_MASK) < BSP_FEATURE_FLASH_HP_CF_REGION0_SIZE)
        {
            start_address = address & ~((BSP_FEATURE_TZ_NS_OFFSET | BSP_FEATURE_FLASH_HP_CF_REGION0_BLOCK_SIZE) - 1);

 #if (FLASH_HP_CFG_PARAM_CHECKING_ENABLE == 1)
            region0_blocks = (BSP_FEATURE_FLASH_HP_CF_REGION0_SIZE - (start_address & FLASH_HP_PRV_BANK1_MASK)) /
                             BSP_FEATURE_FLASH_HP_CF_REGION0_BLOCK_SIZE;
 #endif
        }
        else
        {
            start_address = address & ~((BSP_FEATURE_TZ_NS_OFFSET | BSP_FEATURE_FLASH_HP_CF_REGION1_BLOCK_SIZE) - 1);
        }

 #if (FLASH_HP_CFG_PARAM_CHECKING_ENABLE == 1)
        uint32_t num_bytes = (region0_blocks * BSP_FEATURE_FLASH_HP_CF_REGION0_BLOCK_SIZE);
        if (num_blocks > region0_blocks)
        {
            num_bytes += ((num_blocks - region0_blocks) * BSP_FEATURE_FLASH_HP_CF_REGION1_BLOCK_SIZE);
        }

  #if BSP_FEATURE_FLASH_HP_SUPPORTS_DUAL_BANK
        uint32_t rom_end = 0;

        if ((FLASH_HP_PRV_DUALSEL_BANKMD_MASK != (*flash_hp_dualsel & FLASH_HP_PRV_DUALSEL_BANKMD_MASK)))
        {
            /* Start address out of range  */
            rom_end = BSP_FEATURE_FLASH_HP_CF_DUAL_BANK_START + ((BSP_ROM_SIZE_BYTES & ~UINT16_MAX) / 2);
            FSP_ERROR_RETURN(start_address < rom_end, FSP_ERR_INVALID_ADDRESS);

            /* Region to erase must fall within bank */
            rom_end = (BSP_ROM_SIZE_BYTES & ~UINT16_MAX) / 2;
            FSP_ERROR_RETURN((start_address & FLASH_HP_PRV_BANK1_MASK) + num_bytes <= rom_end, FSP_ERR_INVALID_BLOCKS);
        }
        else
        {
            /* Start address out of range  */
            rom_end = BSP_FEATURE_FLASH_CODE_FLASH_START + BSP_ROM_SIZE_BYTES;
            FSP_ERROR_RETURN(start_address < rom_end, FSP_ERR_INVALID_ADDRESS);

            /* Requested region to erase out of range  */
            FSP_ERROR_RETURN(start_address + num_bytes <= rom_end, FSP_ERR_INVALID_BLOCKS);
        }

  #else
        FSP_ERROR_RETURN(start_address + num_bytes <= (BSP_FEATURE_FLASH_CODE_FLASH_START + BSP_ROM_SIZE_BYTES),
                         FSP_ERR_INVALID_BLOCKS);
  #endif
 #endif
        start_address |= (address & BSP_FEATURE_TZ_NS_OFFSET);
        err            = flash_hp_cf_erase(p_ctrl, start_address, num_blocks);
    }
    else
#endif
    {
#if (FLASH_HP_CFG_DATA_FLASH_PROGRAMMING_ENABLE == 1)
        uint32_t start_address = address & ~((BSP_FEATURE_TZ_NS_OFFSET | BSP_FEATURE_FLASH_HP_DF_BLOCK_SIZE) - 1);

