michaelthomasj/fsp_cmake/ra6m5_gcc_secure/ra/fsp/src/r_flash_hp/r_flash_hp.c
 #if (FLASH_HP_CFG_PARAM_CHECKING_ENABLE == 1)
        uint32_t num_bytes = num_blocks * BSP_FEATURE_FLASH_HP_DF_BLOCK_SIZE;

        FSP_ERROR_RETURN((start_address >= (FLASH_HP_DF_START_ADDRESS)) &&
                         (start_address < (FLASH_HP_DF_START_ADDRESS + BSP_DATA_FLASH_SIZE_BYTES)),
                         FSP_ERR_INVALID_ADDRESS);

        FSP_ERROR_RETURN(start_address + num_bytes <= (FLASH_HP_DF_START_ADDRESS + BSP_DATA_FLASH_SIZE_BYTES),
                         FSP_ERR_INVALID_BLOCKS);
 #endif

        /* Initiate the flash erase. */
        start_address |= (address & BSP_FEATURE_TZ_NS_OFFSET);
        err            = flash_hp_df_erase(p_ctrl, start_address, num_blocks);
        FSP_ERROR_RETURN(FSP_SUCCESS == err, err);
#else

        return FSP_ERR_INVALID_ADDRESS;
#endif
    }

    return err;
}

/*******************************************************************************************************************//**
 * Performs a blank check on the specified address area. Implements @ref flash_api_t::blankCheck.
 *
 * Example:
 * @snippet r_flash_hp_example.c R_FLASH_HP_BlankCheck
 *
 * @retval     FSP_SUCCESS                 Blank check operation completed with result in p_blank_check_result, or
 *                                         blank check started and in-progess (BGO mode).
 * @retval     FSP_ERR_INVALID_ADDRESS     Invalid data flash address was input.
 * @retval     FSP_ERR_INVALID_SIZE        'num_bytes' was either too large or not aligned for the CF/DF boundary size.
 * @retval     FSP_ERR_IN_USE              Other flash operation in progress or API not initialized.
 * @retval     FSP_ERR_ASSERTION           NULL provided for p_ctrl.
 * @retval     FSP_ERR_CMD_LOCKED          FCU is in locked state, typically as a result of attempting to Erase an area
 *                                         that is protected by an Access Window.
 * @retval     FSP_ERR_NOT_OPEN            The Flash API is not Open.
 * @retval     FSP_ERR_TIMEOUT             Timed out waiting for the FCU to become ready.
 * @retval     FSP_ERR_PE_FAILURE          Failed to enter or exit P/E mode.
 * @retval     FSP_ERR_BLANK_CHECK_FAILED  Blank check operation failed.
 **********************************************************************************************************************/
fsp_err_t R_FLASH_HP_BlankCheck (flash_ctrl_t * const p_api_ctrl,
                                 uint32_t const       address,
                                 uint32_t             num_bytes,
                                 flash_result_t     * p_blank_check_result)
{
    flash_hp_instance_ctrl_t * p_ctrl = (flash_hp_instance_ctrl_t *) p_api_ctrl;
    fsp_err_t err = FSP_SUCCESS;

#if (FLASH_HP_CFG_PARAM_CHECKING_ENABLE == 1)

    /* Check parameters. If failure return error */
    err = r_flash_hp_write_bc_parameter_checking(p_ctrl, address & ~BSP_FEATURE_TZ_NS_OFFSET, num_bytes, false);
    FSP_ERROR_RETURN((err == FSP_SUCCESS), err);

    FSP_ASSERT(NULL != p_blank_check_result);
#endif

#if (FLASH_HP_CFG_CODE_FLASH_PROGRAMMING_ENABLE == 1)

    /* Is this a request to Blank check Code Flash? */
    /* If the address is code flash check if the region is blank. If not blank return error. */
    if ((address & ~BSP_FEATURE_TZ_NS_OFFSET) < BSP_FEATURE_FLASH_DATA_FLASH_START)
    {
        /* Blank checking for Code Flash does not require any FCU operations. The specified address area
         * can simply be checked for non 0xFF. */
        p_ctrl->current_operation = FLASH_OPERATION_NON_BGO;
        *p_blank_check_result     = FLASH_RESULT_BLANK; // Assume blank until we know otherwise
        uint8_t * p_address = (uint8_t *) address;
        for (uint32_t index = 0U; index < num_bytes; index++)
        {
            if (p_address[index] != UINT8_MAX)
            {
                *p_blank_check_result = FLASH_RESULT_NOT_BLANK;
                break;
            }
        }
    }
    /* Otherwise the address is data flash. Put the flash in the blank check state. Return status. */
    else
#endif
    {
#if (FLASH_HP_CFG_DATA_FLASH_PROGRAMMING_ENABLE == 1)
        err = flash_hp_df_blank_check(p_ctrl, address, num_bytes, p_blank_check_result);
#endif
    }

    return err;
}

/*******************************************************************************************************************//**
 * Query the FLASH peripheral for its status. Implements @ref flash_api_t::statusGet.
 *
 * Example:
 * @snippet r_flash_hp_example.c R_FLASH_HP_StatusGet
 *
 * @retval     FSP_SUCCESS        FLASH peripheral is ready to use.
 * @retval     FSP_ERR_ASSERTION  NULL provided for p_ctrl.
 * @retval     FSP_ERR_NOT_OPEN   The Flash API is not Open.
 **********************************************************************************************************************/
fsp_err_t R_FLASH_HP_StatusGet (flash_ctrl_t * const p_api_ctrl, flash_status_t * const p_status)
{
#if (FLASH_HP_CFG_PARAM_CHECKING_ENABLE == 1)
    flash_hp_instance_ctrl_t * p_ctrl = (flash_hp_instance_ctrl_t *) p_api_ctrl;

    /* If null pointer return error. */
    FSP_ASSERT(NULL != p_ctrl);
    FSP_ASSERT(NULL != p_status);

    /* If control block is not open return error. */
    FSP_ERROR_RETURN(!(FLASH_HP_OPEN != p_ctrl->opened), FSP_ERR_NOT_OPEN);
#else

    /* Eliminate warning if parameter checking is disabled. */
    FSP_PARAMETER_NOT_USED(p_api_ctrl);
#endif

    /* If the flash is currently in program/erase mode notify the caller that the flash is busy. */
    if ((R_FACI_HP->FENTRYR & FLASH_HP_FENTRYR_PE_MODE_BITS) == 0x0000U)
    {
        *p_status = FLASH_STATUS_IDLE;
    }
    else
    {
        *p_status = FLASH_STATUS_BUSY;
    }

    return FSP_SUCCESS;
}

/*******************************************************************************************************************//**
 * Implements @ref flash_api_t::idCodeSet.
 *
 * @retval     FSP_SUCCESS               ID Code successfully configured.
 * @retval     FSP_ERR_IN_USE            FLASH peripheral is busy with a prior operation.
 * @retval     FSP_ERR_ASSERTION         NULL provided for p_ctrl.
 * @retval     FSP_ERR_UNSUPPORTED       Code Flash Programming is not enabled.
 * @retval     FSP_ERR_NOT_OPEN          Flash API has not yet been opened.
 * @retval     FSP_ERR_PE_FAILURE        Failed to enter or exit Code Flash P/E mode.
 * @retval     FSP_ERR_TIMEOUT           Timed out waiting for the FCU to become ready.
 * @retval     FSP_ERR_WRITE_FAILED      Status is indicating a Programming error for the requested operation.
 * @retval     FSP_ERR_CMD_LOCKED        FCU is in locked state, typically as a result of having received an illegal
 *                                       command.
 **********************************************************************************************************************/
fsp_err_t R_FLASH_HP_IdCodeSet (flash_ctrl_t * const  p_api_ctrl,
                                uint8_t const * const p_id_code,
                                flash_id_code_mode_t  mode)
{
    flash_hp_instance_ctrl_t * p_ctrl = (flash_hp_instance_ctrl_t *) p_api_ctrl;

    fsp_err_t err = FSP_SUCCESS;

#if (FLASH_HP_CFG_CODE_FLASH_PROGRAMMING_ENABLE == 1) && (BSP_FEATURE_FLASH_SUPPORTS_ID_CODE == 1)
 #if (FLASH_HP_CFG_PARAM_CHECKING_ENABLE)

    /* Verify the id bytes are not in code flash. They will not be available in P/E mode. */
    FSP_ASSERT(((uint32_t) p_id_code) > BSP_ROM_SIZE_BYTES);

    /* Verify the control block is not null and is opened. */
    err = r_flash_hp_common_parameter_checking(p_ctrl);
    FSP_ERROR_RETURN(FSP_SUCCESS == err, err);
 #endif

    /* If successful set the id code. */
    err = flash_hp_set_id_code(p_ctrl, p_id_code, mode);
#else

