michaelthomasj/fsp_cmake/ra6m5_gcc_secure/ra/fsp/src/r_flash_hp/r_flash_hp.c
#if BSP_TZ_SECURE_BUILD

    /* Get security state of p_callback */
    bool callback_is_secure =
        (NULL == cmse_check_address_range((void *) p_callback, sizeof(void *), CMSE_AU_NONSECURE));

 #if FLASH_HP_CFG_PARAM_CHECKING_ENABLE

    /* In secure projects, p_callback_memory must be provided in non-secure space if p_callback is non-secure */
    flash_callback_args_t * const p_callback_memory_checked = cmse_check_pointed_object(p_callback_memory,
                                                                                        CMSE_AU_NONSECURE);
    FSP_ERROR_RETURN(callback_is_secure || (NULL != p_callback_memory_checked), FSP_ERR_NO_CALLBACK_MEMORY);
 #endif
#endif

    /* Store callback and context */
#if BSP_TZ_SECURE_BUILD
    p_ctrl->p_callback = callback_is_secure ? p_callback :
                         (void (*)(flash_callback_args_t *))cmse_nsfptr_create(p_callback);
#else
    p_ctrl->p_callback = p_callback;
#endif
    p_ctrl->p_context         = p_context;
    p_ctrl->p_callback_memory = p_callback_memory;

    return FSP_SUCCESS;
}

/*******************************************************************************************************************//**
 * Increments the selected anti-rollback counter.
 *
 * @warning If this function returns an error code other than FSP_SUCCESS, or power loss occurs during a call to this function,
 * call @ref R_FLASH_HP_AntiRollbackCounterRefresh to ensure the counter flash is in a valid state following the error.
 *
 * @note The counter is read internally before increment.
 *
 * Implements @ref flash_api_t::antiRollbackCounterIncrement
 *
 * @retval     FSP_SUCCESS          Counter incremented successfully
 * @retval     FSP_ERR_NOT_OPEN     The control block is not open.
 * @retval     FSP_ERR_ASSERTION    NULL provided for p_api_ctrl
 * @retval     FSP_ERR_NOT_ENABLED  The specified counter has not been configured (configuration is only required for ARC_NSEC)
 * @retval     FSP_ERR_OVERFLOW     The counter cannot be incremented because it is already at its max value
 * @retval     FSP_ERR_PE_FAILURE   Failed to enter or exit Data Flash P/E mode.
 * @retval     FSP_ERR_TIMEOUT      Timed out waiting for the FCU to become ready.
 * @retval     FSP_ERR_CMD_LOCKED   FCU is in locked state, typically as a result of having received an illegal command
 * @retval     FSP_ERR_UNSUPPORTED  Data flash programming is not enabled or selected anti-rollback counter is not supported on this MCU
 **********************************************************************************************************************/
fsp_err_t R_FLASH_HP_AntiRollbackCounterIncrement (flash_ctrl_t * const p_api_ctrl, flash_arc_t counter)
{
    fsp_err_t err;

#if (FLASH_HP_CFG_DATA_FLASH_PROGRAMMING_ENABLE == 1) && (BSP_FEATURE_FLASH_SUPPORTS_ANTI_ROLLBACK == 1)
    flash_hp_instance_ctrl_t * p_ctrl = (flash_hp_instance_ctrl_t *) p_api_ctrl;
    uint8_t fcntselr = flash_hp_counter_to_fcntselr_convert(counter);

 #if FLASH_HP_CFG_PARAM_CHECKING_ENABLE
    err = r_flash_hp_arc_common_parameter_checking(p_ctrl, counter, fcntselr);
    FSP_ERROR_RETURN(FSP_SUCCESS == err, err);
 #endif

    /* Read the current counter value*/
    uint32_t count;
    err = flash_hp_arc_read(p_ctrl, fcntselr, &count);
    FSP_ERROR_RETURN(FSP_SUCCESS == err, err);

    /* Check for overflow. */
    uint32_t max_count;
    if (counter >= FLASH_ARC_NSEC_0)
    {
        uint8_t arcns = R_OFS_DATAFLASH->ARCCS_b.CNF_ARCNS;
        max_count = (arcns == FLASH_HP_PRV_ARCNS_MULTIPLE) ?
                    BSP_FEATURE_FLASH_ARC_NSEC_MULTIPLE_MAX_COUNT : BSP_FEATURE_FLASH_ARC_NSEC_SINGLE_MAX_COUNT;
    }
    else if (counter == FLASH_ARC_OEMBL)
    {
        max_count = BSP_FEATURE_FLASH_ARC_OEMBL_MAX_COUNT;
    }
    else
    {
        max_count = BSP_FEATURE_FLASH_ARC_SEC_MAX_COUNT;
    }

    FSP_ERROR_RETURN((count + 1) <= max_count, FSP_ERR_OVERFLOW);

    /* Increment the counter */
    err = flash_hp_arc_cmd_execute(p_ctrl,
                                   fcntselr,
                                   FLASH_HP_FACI_CMD_INCREMENT_COUNTER,
                                   p_ctrl->timeout_arc_increment_refresh);
#else
    FSP_PARAMETER_NOT_USED(p_api_ctrl);
    FSP_PARAMETER_NOT_USED(counter);

    err = FSP_ERR_UNSUPPORTED;
#endif

    return err;
}

/*******************************************************************************************************************//**
 * Refreshes the selected anti-rollback counter flash area to ensure the flash is in a valid state even if an error
 * occurred during counter increment processing.
 *
 * This function must be called if errors or power failure occurred during counter increment.
 *
 * Power failure can be detected by the application code by management of user-defined non-voltile flags during
 * counter increment.
 *
 * Until a refresh completes successfully, the value of the anti-rollback counter cannot be guaranteed and should not
 * be read.
 *
 * Implements @ref flash_api_t::antiRollbackCounterRefresh
 *
 * @retval     FSP_SUCCESS          Counter refreshed successfully
 * @retval     FSP_ERR_NOT_OPEN     The control block is not open.
 * @retval     FSP_ERR_ASSERTION    NULL provided for p_ctrl
 * @retval     FSP_ERR_NOT_ENABLED  The specified counter has not been configured (configuration is only required for ARC_NSEC)
 * @retval     FSP_ERR_PE_FAILURE   Failed to enter or exit Data Flash P/E mode.
 * @retval     FSP_ERR_TIMEOUT      Timed out waiting for the FCU to become ready.
 * @retval     FSP_ERR_CMD_LOCKED   FCU is in locked state, typically as a result of having received an illegal command
 * @retval     FSP_ERR_UNSUPPORTED  Data flash programming is not enabled or Anti-Rollback counter is not supported on this MCU
 **********************************************************************************************************************/
fsp_err_t R_FLASH_HP_AntiRollbackCounterRefresh (flash_ctrl_t * const p_api_ctrl, flash_arc_t counter)
{
    fsp_err_t err;

#if (FLASH_HP_CFG_DATA_FLASH_PROGRAMMING_ENABLE == 1) && (BSP_FEATURE_FLASH_SUPPORTS_ANTI_ROLLBACK == 1)
    flash_hp_instance_ctrl_t * p_ctrl = (flash_hp_instance_ctrl_t *) p_api_ctrl;
    uint8_t fcntselr = flash_hp_counter_to_fcntselr_convert(counter);

 #if FLASH_HP_CFG_PARAM_CHECKING_ENABLE
    err = r_flash_hp_arc_common_parameter_checking(p_ctrl, counter, fcntselr);
    FSP_ERROR_RETURN(FSP_SUCCESS == err, err);
 #endif

