michaelthomasj/fsp_cmake/ra6m5_gcc_secure/ra/fsp/src/r_flash_hp/r_flash_hp.c
    /* Refresh the counter */
    err = flash_hp_arc_cmd_execute(p_ctrl,
                                   fcntselr,
                                   FLASH_HP_FACI_CMD_REFRESH_COUNTER,
                                   p_ctrl->timeout_arc_increment_refresh);
#else
    FSP_PARAMETER_NOT_USED(p_api_ctrl);
    FSP_PARAMETER_NOT_USED(counter);

    err = FSP_ERR_UNSUPPORTED;
#endif

    return err;
}

/*******************************************************************************************************************//**
 * Reads the selected anti-rollback counter and returns the number of counter bits set.
 *
 * Implements @ref flash_api_t::antiRollbackCounterRead
 *
 * @retval     FSP_SUCCESS          Counter read successfully into p_count
 * @retval     FSP_ERR_NOT_OPEN     The control block is not open.
 * @retval     FSP_ERR_ASSERTION    NULL provided for p_api_ctrl or p_count
 * @retval     FSP_ERR_NOT_ENABLED  The specified counter has not been configured (configuration is only required for ARC_NSEC)
 * @retval     FSP_ERR_PE_FAILURE   Failed to enter or exit Data Flash P/E mode.
 * @retval     FSP_ERR_TIMEOUT      Timed out waiting for the FCU to become ready.
 * @retval     FSP_ERR_CMD_LOCKED   FCU is in locked state, typically as a result of having received an illegal command
 * @retval     FSP_ERR_UNSUPPORTED  Data flash programming is not enabled or Anti-Rollback counter is not supported on this MCU
 **********************************************************************************************************************/
fsp_err_t R_FLASH_HP_AntiRollbackCounterRead (flash_ctrl_t * const p_api_ctrl,
                                              flash_arc_t          counter,
                                              uint32_t * const     p_count)
{
    fsp_err_t err;

#if (FLASH_HP_CFG_DATA_FLASH_PROGRAMMING_ENABLE == 1) && (BSP_FEATURE_FLASH_SUPPORTS_ANTI_ROLLBACK == 1)
    flash_hp_instance_ctrl_t * p_ctrl = (flash_hp_instance_ctrl_t *) p_api_ctrl;
    uint8_t fcntselr = flash_hp_counter_to_fcntselr_convert(counter);

 #if FLASH_HP_CFG_PARAM_CHECKING_ENABLE
    err = r_flash_hp_arc_common_parameter_checking(p_ctrl, counter, fcntselr);
    FSP_ERROR_RETURN(FSP_SUCCESS == err, err);
    FSP_ASSERT(p_count);
 #endif

    /* Read the counter */
    err = flash_hp_arc_read(p_ctrl, fcntselr, p_count);
    FSP_ERROR_RETURN(FSP_SUCCESS == err, err);
#else
    FSP_PARAMETER_NOT_USED(p_api_ctrl);
    FSP_PARAMETER_NOT_USED(counter);
    FSP_PARAMETER_NOT_USED(p_count);

    err = FSP_ERR_UNSUPPORTED;
#endif

    return err;
}

/*******************************************************************************************************************//**
 * Write to the user lockable area in flash
 *
 * Implements @ref flash_api_t::userLockableAreaWrite
 *
 * @note    BGO is not supported for user lockable area flash operations.
 *
 * @retval     FSP_SUCCESS              Operation successful.
 * @retval     FSP_ERR_IN_USE           The Flash peripheral is busy with a prior on-going transaction.
 * @retval     FSP_ERR_NOT_OPEN         The Flash API is not Open.
 * @retval     FSP_ERR_CMD_LOCKED       FCU is in locked state, typically as a result of attempting to Write an area
 *                                      that is protected by an Access Window.
 * @retval     FSP_ERR_WRITE_FAILED     Status is indicating a Programming error for the requested operation.
 * @retval     FSP_ERR_TIMEOUT          Timed out waiting for FCU operation to complete.
 * @retval     FSP_ERR_INVALID_SIZE     Number of bytes provided was not a multiple of the programming size or exceeded
 *                                      the maximum range.
 * @retval     FSP_ERR_INVALID_ADDRESS  Invalid address was input or address not on programming boundary.
 * @retval     FSP_ERR_ASSERTION        NULL provided for p_ctrl.
 * @retval     FSP_ERR_PE_FAILURE       Failed to enter or exit P/E mode.
 **********************************************************************************************************************/
fsp_err_t R_FLASH_HP_UserLockableAreaWrite (flash_ctrl_t * const p_api_ctrl,
                                            uint32_t const       src_address,
                                            uint32_t             flash_address,
                                            uint32_t const       num_bytes)
{
    fsp_err_t err;

#if (FLASH_HP_CFG_DATA_FLASH_PROGRAMMING_ENABLE == 1) && (BSP_FEATURE_FLASH_USER_LOCKABLE_AREA_SIZE > 0)
    flash_hp_instance_ctrl_t * p_ctrl = (flash_hp_instance_ctrl_t *) p_api_ctrl;

 #if (FLASH_HP_CFG_PARAM_CHECKING_ENABLE == 1)
    err = r_flash_hp_write_bc_parameter_checking(p_ctrl, flash_address, num_bytes, true);
    FSP_ERROR_RETURN(FSP_SUCCESS == err, err);
 #endif
    err = flash_hp_user_lockable_area_write(p_ctrl, src_address, flash_address, num_bytes);
#else
    FSP_PARAMETER_NOT_USED(p_api_ctrl);
    FSP_PARAMETER_NOT_USED(src_address);
    FSP_PARAMETER_NOT_USED(flash_address);
    FSP_PARAMETER_NOT_USED(num_bytes);

    err = FSP_ERR_UNSUPPORTED;
#endif

    return err;
}

/*******************************************************************************************************************//**
 * @} (end addtogroup FLASH_HP)
 **********************************************************************************************************************/

/*******************************************************************************************************************//**
 * Write data to the flash.
 *
 * @param      p_ctrl              Pointer to the control block
 * @param[in]  write_size          The write size
 * @param[in]  timeout             The timeout
 *
 * @retval     FSP_SUCCESS         Write completed successfully
 * @retval     FSP_ERR_TIMEOUT     Flash timed out during write operation.
 **********************************************************************************************************************/
static fsp_err_t flash_hp_write_data (flash_hp_instance_ctrl_t * const p_ctrl, uint32_t write_size, uint32_t timeout)
{
#if !(BSP_FEATURE_FLASH_HP_VERSION == 4)
    volatile uint32_t wait_count;
#endif

    if (0 == timeout)
    {
        /* Disable flash interrupts until command final is written. */
        R_BSP_IrqDisable(p_ctrl->p_cfg->irq);
    }

    /* Set block start address */
    R_FACI_HP->FSADDR = p_ctrl->dest_end_address;

    /* Issue two part Write commands */
    R_FACI_HP_CMD->FACI_CMD8 = FLASH_HP_FACI_CMD_PROGRAM;

    /* Write 2 bytes at a time */
    uint32_t line_size = write_size / 2U;
    uint32_t increment = 2U;

#if (BSP_FEATURE_FLASH_HP_DF_WRITE_SIZE == 1) || (BSP_FEATURE_FLASH_HP_CF_WRITE_SIZE == 1)

