michaelthomasj/fsp_cmake/ra6m5_gcc_secure/ra/fsp/src/r_flash_hp/r_flash_hp.c
    /* Special case for line size of 1, where only 1 byte is written at a time */
    if (1U == write_size)
    {
        line_size = 1;
        increment = 1;
    }
#endif

    R_FACI_HP_CMD->FACI_CMD8 = (uint8_t) line_size;

    /* Write one line. If timeout stop the flash and return error. */
    for (uint32_t i = 0U; i < line_size; i++)
    {
        /* Copy data from source address to destination area */
        R_FACI_HP_CMD->FACI_CMD16 = *(uint16_t *) p_ctrl->source_start_address;

#if !(BSP_FEATURE_FLASH_HP_VERSION == 4)
        wait_count = p_ctrl->timeout_dbfull;

        while (R_FACI_HP->FSTATR_b.DBFULL == 1U)
        {
            /* Wait until DBFULL is 0 unless timeout occurs. */
            if (wait_count-- == 0U)
            {

                /* If DBFULL is not set to 0 return timeout. */
                return FSP_ERR_TIMEOUT;
            }
        }
#endif

        p_ctrl->source_start_address += increment;
        p_ctrl->dest_end_address     += increment;
        p_ctrl->operations_remaining--;
    }

    /* Issue write end command */
    R_FACI_HP_CMD->FACI_CMD8 = FLASH_HP_FACI_CMD_FINAL;

    /* If a timeout has been supplied wait for the flash to become ready. Otherwise return immediately. */
    if (timeout)
    {
        /* Read FRDY bit until it has been set to 1 indicating that the current operation is complete.*/
        /* Wait until operation has completed or timeout occurs. If timeout stop the module and return error. */
        while (1U != R_FACI_HP->FSTATR_b.FRDY)
        {
            /* Wait until FRDY is 1 unless timeout occurs. */
            if (timeout == 0U)
            {
                return FSP_ERR_TIMEOUT;
            }

            timeout--;
        }
    }
    else
    {
        /* Enable flash interrupts following write sequence. */
        R_BSP_IrqEnableNoClear(p_ctrl->p_cfg->irq);
    }

    return FSP_SUCCESS;
}

/*******************************************************************************************************************//**
 * Check for errors after a flash operation
 *
 * @param[in]  previous_error      The previous error
 * @param[in]  error_bits          The error bits
 * @param[in]  return_error        The return error
 *
 * @retval     FSP_SUCCESS         Command completed successfully
 * @retval     FSP_ERR_CMD_LOCKED  Flash entered command locked state
 **********************************************************************************************************************/
static fsp_err_t flash_hp_check_errors (fsp_err_t previous_error, uint32_t error_bits, fsp_err_t return_error)
{
    /* See "Recovery from the Command-Locked State" in the Flash Memory section of the relevant hardware manual. */
    fsp_err_t err = FSP_SUCCESS;
    if (1U == R_FACI_HP->FASTAT_b.CMDLK)
    {
        /* If an illegal error occurred read and clear CFAE and DFAE in FASTAT. */
        if (1U == R_FACI_HP->FSTATR_b.ILGLERR)
        {
            R_FACI_HP->FASTAT;
            R_FACI_HP->FASTAT = 0;
        }

        err = FSP_ERR_CMD_LOCKED;
    }

    /* Check if status is indicating a Programming error */
    /* If a programming error occurred return error. */
    if (R_FACI_HP->FSTATR & error_bits)
    {
        err = return_error;
    }

    /* Return the first error code that was encountered. */
    if (FSP_SUCCESS != previous_error)
    {
        err = previous_error;
    }

    if (FSP_SUCCESS != err)
    {
        /* Stop the flash and return the previous error. */
        (void) flash_hp_stop();
    }

    return err;
}

#if (FLASH_HP_CFG_CODE_FLASH_PROGRAMMING_ENABLE == 1)

/*******************************************************************************************************************//**
 * This function initiates the write sequence for the R_FLASH_HP_Write() function.
 * @param[in]  p_ctrl                Flash control block
 * @retval     FSP_SUCCESS           The write started successfully.
 * @retval     FSP_ERR_PE_FAILURE    Failed to enter or exit Code Flash P/E mode.
 * @retval     FSP_ERR_CMD_LOCKED    Flash entered command locked state.
 * @retval     FSP_ERR_TIMEOUT       Flash timed out during write operation.
 * @retval     FSP_ERR_WRITE_FAILED  Flash write operation failed.
 **********************************************************************************************************************/
static fsp_err_t flash_hp_cf_write (flash_hp_instance_ctrl_t * const p_ctrl)
{
    fsp_err_t err = FSP_SUCCESS;

    /* Update Flash state and enter the respective Code or Data Flash P/E mode. If failure return error */
    err = flash_hp_enter_pe_cf_mode(p_ctrl);
    FSP_ERROR_RETURN(FSP_SUCCESS == err, err);

    /* Iterate through the number of data bytes */
    while (p_ctrl->operations_remaining && (err == FSP_SUCCESS))
    {
        err = flash_hp_write_data(p_ctrl, BSP_FEATURE_FLASH_HP_CF_WRITE_SIZE, p_ctrl->timeout_write_cf);

        err = flash_hp_check_errors(err, FLASH_HP_FSTATR_PRGERR | FLASH_HP_FSTATR_ILGLERR, FSP_ERR_WRITE_FAILED);
    }

    /* Return to read mode*/
    fsp_err_t pe_exit_err = flash_hp_pe_mode_exit();

    if (FSP_SUCCESS == err)
    {
        err = pe_exit_err;
    }

    /* Return status. */
    return err;
}

 #if (BSP_FEATURE_FLASH_HP_SUPPORTS_DUAL_BANK == 1)

/*******************************************************************************************************************//**
 * This function checks the security attribution of the Bank Select Register BANKSWP bits and returns the appropriate
 * register address according to the configured attribution: BANKSEL for nonsecure attribution
 * and BANKSEL_SEC for secure attribution.
 *
 * The security attribution of the BANKSWP bits must be read from the BANKSEL_SEL register rather than determined
 * from compile time macros in case another program (eg. a bootloader) has modified the configuration area.
 *
 * @retval     uint32_t       Address of bank select register bankswap setting
 **********************************************************************************************************************/
static uint32_t flash_hp_banksel_bankswp_addr_get (void)
{
    volatile uint32_t * const flash_hp_banksel_sel = (uint32_t *) FLASH_HP_BANK_MODE_SECURITY_ATTRIBUTION;

    /* Check if non-secure attribution is selected */
    if ((*flash_hp_banksel_sel & FLASH_HP_PRV_BANKSEL_BANKSWP_MASK) == FLASH_HP_PRV_BANKSEL_BANKSWP_MASK)
    {
        return FLASH_HP_FCU_CONFIG_SET_BANK_MODE;
    }

    /* Secure attribution selected, return address of secure register */
    return FLASH_HP_FCU_CONFIG_SET_BANK_MODE_SEC;
}

/*******************************************************************************************************************//**
 * This function swaps which flash bank will be used to boot from after the next reset.
 * @param[in]  p_ctrl                Flash control block
 * @retval     FSP_SUCCESS           The write started successfully.
 * @retval     FSP_ERR_PE_FAILURE    Failed to enter or exit Code Flash P/E mode.
 * @retval     FSP_ERR_CMD_LOCKED    Flash entered command locked state.
 * @retval     FSP_ERR_TIMEOUT       Flash timed out during write operation.
 * @retval     FSP_ERR_WRITE_FAILED  Flash write operation failed.
 **********************************************************************************************************************/
static fsp_err_t flash_hp_bank_swap (flash_hp_instance_ctrl_t * const p_ctrl)
{
    fsp_err_t err = FSP_SUCCESS;

