michaelthomasj/fsp_cmake/ra6m5_gcc_secure/ra/fsp/src/r_flash_hp/r_flash_hp.c
    uint32_t const flash_hp_banksel = flash_hp_banksel_bankswp_addr_get();

    /* Unused bits should be written as 1. */
    g_configuration_area_data[0] =
        (uint16_t) ((~FLASH_HP_PRV_BANKSEL_BANKSWP_MASK) |
                    (~(FLASH_HP_PRV_BANKSEL_BANKSWP_MASK & *((volatile uint32_t *) flash_hp_banksel))));

    memset(&g_configuration_area_data[1], UINT8_MAX, 7 * sizeof(uint16_t));

    flash_hp_enter_pe_cf_mode(p_ctrl);

    /* Write the configuration area to the access/startup region. */
    err = flash_hp_configuration_area_write(p_ctrl, flash_hp_banksel, g_configuration_area_data);

    err = flash_hp_check_errors(err, 0, FSP_ERR_WRITE_FAILED);

    /* Return to read mode*/
    fsp_err_t pe_exit_err = flash_hp_pe_mode_exit();

    if (FSP_SUCCESS == err)
    {
        err = pe_exit_err;
    }

    /* Return status. */
    return err;
}

 #endif
#endif

#if (FLASH_HP_CFG_DATA_FLASH_PROGRAMMING_ENABLE == 1)

/*******************************************************************************************************************//**
 * This function initiates the write sequence for the R_FLASH_HP_Write() function.
 * @param[in]  p_ctrl                Flash control block
 * @retval     FSP_SUCCESS           The write started successfully.
 * @retval     FSP_ERR_PE_FAILURE    Failed to enter or exit P/E mode.
 * @retval     FSP_ERR_CMD_LOCKED    Flash entered command locked state.
 * @retval     FSP_ERR_TIMEOUT       Flash timed out during write operation.
 * @retval     FSP_ERR_WRITE_FAILED  Flash write operation failed.
 **********************************************************************************************************************/
static fsp_err_t flash_hp_df_write (flash_hp_instance_ctrl_t * const p_ctrl)
{
    fsp_err_t err = FSP_SUCCESS;

    /* Update Flash state and enter the respective Code or Data Flash P/E mode. If failure return error */
    err = flash_hp_enter_pe_df_mode(p_ctrl);
    FSP_ERROR_RETURN(FSP_SUCCESS == err, err);

    uint32_t wait_count;

    /* If in BGO mode, exit here; remaining processing if any will be done in ISR */
    if (p_ctrl->p_cfg->data_flash_bgo == true)
    {
        p_ctrl->current_operation = FLASH_OPERATION_DF_BGO_WRITE;
        wait_count                = 0;
    }
    else
    {
        wait_count = p_ctrl->timeout_write_df;
    }

    do
    {
        err = flash_hp_write_data(p_ctrl, BSP_FEATURE_FLASH_HP_DF_WRITE_SIZE, wait_count);

        if (p_ctrl->p_cfg->data_flash_bgo)
        {

            /* Errors will be handled in the error interrupt when using BGO. */
            return err;
        }

        err = flash_hp_check_errors(err, FLASH_HP_FSTATR_PRGERR, FSP_ERR_WRITE_FAILED);
    } while (p_ctrl->operations_remaining && (err == FSP_SUCCESS));

    /* Return to read mode*/
    fsp_err_t pe_exit_err = flash_hp_pe_mode_exit();

    if (FSP_SUCCESS == err)
    {
        err = pe_exit_err;
    }

    return err;
}

#endif

#if (FLASH_HP_CFG_PARAM_CHECKING_ENABLE == 1)

/*******************************************************************************************************************//**
 * This function performs the parameter checking required by the write, read and blank check functions.
 *
 * @param[in]  p_ctrl                   Flash control block
 * @param[in]  flash_address            The flash address to be written to
 * @param[in]  num_bytes                The number bytes
 * @param[in]  check_write              Check that the parameters are valid for a write.
 *
 * @retval     FSP_SUCCESS              Parameter checking completed without error.
 * @retval     FSP_ERR_IN_USE           The Flash peripheral is busy with a prior on-going transaction.
 * @retval     FSP_ERR_NOT_OPEN         The Flash API is not Open.
 * @retval     FSP_ERR_ASSERTION        Null pointer
 * @retval     FSP_ERR_INVALID_SIZE     Number of bytes provided was not a multiple of the programming size or exceeded
 *                                      the maximum range.
 * @retval     FSP_ERR_INVALID_ADDRESS  Invalid address was input or address not on programming boundary.
 **********************************************************************************************************************/
static fsp_err_t r_flash_hp_write_bc_parameter_checking (flash_hp_instance_ctrl_t * const p_ctrl,
                                                         uint32_t                         flash_address,
                                                         uint32_t const                   num_bytes,
                                                         bool                             check_write)
{
    /* Verify the control block is not null and is opened. Verify the flash isn't in use. */
    fsp_err_t err = r_flash_hp_common_parameter_checking(p_ctrl);
    FSP_ERROR_RETURN(FSP_SUCCESS == err, err);

    uint32_t write_size;

    if (p_ctrl->p_cfg->data_flash_bgo == true)
    {
        FSP_ASSERT(NULL != p_ctrl->p_callback);
    }

    /* If invalid address or number of bytes return error. */
 #if (FLASH_HP_CFG_CODE_FLASH_PROGRAMMING_ENABLE == 1)
    if (flash_address < BSP_FEATURE_FLASH_DATA_FLASH_START)
    {
  #if BSP_FEATURE_FLASH_CODE_FLASH_START != 0
        FSP_ERROR_RETURN(BSP_FEATURE_FLASH_CODE_FLASH_START <= flash_address, FSP_ERR_INVALID_ADDRESS);
  #endif
        uint32_t rom_end = BSP_ROM_SIZE_BYTES;
  #if BSP_FEATURE_FLASH_HP_SUPPORTS_DUAL_BANK
        if (0 == (FLASH_HP_PRV_DUALSEL_BANKMD_MASK & *flash_hp_dualsel))
        {
            flash_address &= ~BSP_FEATURE_FLASH_HP_CF_DUAL_BANK_START;
            rom_end        = BSP_ROM_SIZE_BYTES / 2;
        }
  #endif

  #if BSP_FEATURE_FLASH_CODE_FLASH_START != 0
        flash_address &= ~BSP_FEATURE_FLASH_CODE_FLASH_START;
  #endif

        FSP_ERROR_RETURN(flash_address <= rom_end, FSP_ERR_INVALID_ADDRESS);
        FSP_ERROR_RETURN(flash_address + num_bytes <= rom_end, FSP_ERR_INVALID_SIZE);
        write_size = BSP_FEATURE_FLASH_HP_CF_WRITE_SIZE;
    }
    else
 #endif
    {
 #if (FLASH_HP_CFG_DATA_FLASH_PROGRAMMING_ENABLE == 1)
        uint32_t start;
        uint32_t end;

  #if (BSP_FEATURE_FLASH_USER_LOCKABLE_AREA_SIZE > 0)
        if (flash_address >= BSP_FEATURE_FLASH_USER_LOCKABLE_AREA_START)
        {
            start = BSP_FEATURE_FLASH_USER_LOCKABLE_AREA_START;
            end   = BSP_FEATURE_FLASH_USER_LOCKABLE_AREA_START + BSP_FEATURE_FLASH_USER_LOCKABLE_AREA_SIZE;
        }
        else
  #endif
        {
            start = FLASH_HP_DF_START_ADDRESS;
            end   = FLASH_HP_DF_START_ADDRESS + BSP_DATA_FLASH_SIZE_BYTES;
        }

        write_size = BSP_FEATURE_FLASH_HP_DF_WRITE_SIZE;

