michaelthomasj/fsp_cmake/ra6m5_gcc_secure/ra/fsp/src/r_flash_hp/r_flash_hp.c
        FSP_ERROR_RETURN((flash_address >= start) && (flash_address < end), FSP_ERR_INVALID_ADDRESS);
        FSP_ERROR_RETURN(((flash_address + num_bytes) <= end), FSP_ERR_INVALID_SIZE);
 #else

        return FSP_ERR_INVALID_ADDRESS;
 #endif
    }

    if (check_write)
    {
        FSP_ERROR_RETURN(!(flash_address & (write_size - 1U)), FSP_ERR_INVALID_ADDRESS);
        FSP_ERROR_RETURN(!(num_bytes & (write_size - 1U)), FSP_ERR_INVALID_SIZE);
    }

    /* If invalid number of bytes return error. */
    FSP_ERROR_RETURN((0 != num_bytes), FSP_ERR_INVALID_SIZE);

    /* If control block is not open return error. */
    FSP_ERROR_RETURN((FLASH_HP_OPEN == p_ctrl->opened), FSP_ERR_NOT_OPEN);

    return FSP_SUCCESS;
}

#endif

#if (FLASH_HP_CFG_PARAM_CHECKING_ENABLE == 1)

/*******************************************************************************************************************//**
 * This function performs the common parameter checking required by top level API functions.
 * @param      p_ctrl             Pointer to the control block
 * @retval     FSP_SUCCESS        Parameter checking completed without error.
 * @retval     FSP_ERR_ASSERTION  Null pointer
 * @retval     FSP_ERR_NOT_OPEN   The flash module is not open.
 * @retval     FSP_ERR_IN_USE     The Flash peripheral is busy with a prior on-going transaction.
 **********************************************************************************************************************/
static fsp_err_t r_flash_hp_common_parameter_checking (flash_hp_instance_ctrl_t * const p_ctrl)
{
    /* If null control block return error. */
    FSP_ASSERT(p_ctrl);

    /* If control block is not open return error. */
    FSP_ERROR_RETURN((FLASH_HP_OPEN == p_ctrl->opened), FSP_ERR_NOT_OPEN);

    /* If the flash is currently in program/erase mode return an error. */
    FSP_ERROR_RETURN((R_FACI_HP->FENTRYR & FLASH_HP_FENTRYR_PE_MODE_BITS) == 0x0000U, FSP_ERR_IN_USE);

    return FSP_SUCCESS;
}

 #if (FLASH_HP_CFG_DATA_FLASH_PROGRAMMING_ENABLE == 1) && (BSP_FEATURE_FLASH_SUPPORTS_ANTI_ROLLBACK == 1)
static fsp_err_t r_flash_hp_arc_common_parameter_checking (flash_hp_instance_ctrl_t * const p_ctrl,
                                                           flash_arc_t                      counter,
                                                           uint8_t                          fcntselr)
{
    fsp_err_t err = r_flash_hp_common_parameter_checking(p_ctrl);
    FSP_ERROR_RETURN(err == FSP_SUCCESS, err);

    uint8_t arcns = R_OFS_DATAFLASH->ARCCS_b.CNF_ARCNS;
    uint8_t target_counter_is_arc_ns  = fcntselr & 0x4;
    uint8_t target_counter_is_enabled = (FLASH_HP_PRV_ARCNS_MULTIPLE == arcns) ||
                                        ((FLASH_HP_PRV_ARCNS_SINGLE == arcns) && (counter == FLASH_ARC_NSEC_0));

    /* Ensure that requested counter is supported by hardware. Some MCUs may not support all counter types. */
  #if (0 == BSP_FEATURE_FLASH_ARC_OEMBL_MAX_COUNT)
    FSP_ERROR_RETURN(counter != FLASH_ARC_OEMBL, FSP_ERR_UNSUPPORTED);
  #endif

  #if (0 == BSP_FEATURE_FLASH_ARC_SEC_MAX_COUNT)
    FSP_ERROR_RETURN(counter != FLASH_ARC_SEC, FSP_ERR_UNSUPPORTED);
  #endif

  #if (0 == BSP_FEATURE_FLASH_ARC_NSEC_NUM_COUNTERS)
    FSP_ERROR_RETURN(0 == target_counter_is_arc_ns, FSP_ERR_UNSUPPORTED);
  #endif

    /* Ensure that requested NSEC counter has been configured when NSEC is the target counter */
    FSP_ERROR_RETURN(!target_counter_is_arc_ns || target_counter_is_enabled, FSP_ERR_NOT_ENABLED);

    return FSP_SUCCESS;
}

 #endif

#endif

#if (FLASH_HP_CFG_DATA_FLASH_PROGRAMMING_ENABLE == 1)

/*******************************************************************************************************************//**
 * This function performs the Blank check phase required by the R_FLASH_HP_BlankCheck() function.
 *
 * @param[in]  p_ctrl                      Flash control block
 * @param[in]  address                     The start address of the range to blank check
 * @param[in]  num_bytes                   The number bytes
 * @param[out] p_blank_check_result        The blank check result
 *
 * @retval     FSP_SUCCESS                 Setup completed completed without error.
 * @retval     FSP_ERR_PE_FAILURE          Failed to enter P/E mode
 * @retval     FSP_ERR_CMD_LOCKED          Peripheral in command locked state.
 * @retval     FSP_ERR_TIMEOUT             Timed out waiting for the FCU to become ready.
 * @retval     FSP_ERR_BLANK_CHECK_FAILED  Blank check operation failed.
 **********************************************************************************************************************/
static fsp_err_t flash_hp_df_blank_check (flash_hp_instance_ctrl_t * const p_ctrl,
                                          uint32_t const                   address,
                                          uint32_t                         num_bytes,
                                          flash_result_t                 * p_blank_check_result)
{
    fsp_err_t err;

    /* This is a request to Blank check Data Flash */
    err = flash_hp_enter_pe_df_mode(p_ctrl);
    FSP_ERROR_RETURN(FSP_SUCCESS == err, err);

    /* Start the Blank check operation. If BGO is enabled then the result of the Blank check will be
     * available when the interrupt occurs and p_blank_check_result will contain FLASH_RESULT_BGO_ACTIVE */

    /* Call blank check. If successful and not DF BGO operation then enter read mode. */
    /* Set the mode to incremental*/
    R_FACI_HP->FBCCNT = 0x00U;

    /* Set the start address for blank checking*/
    R_FACI_HP->FSADDR = address;

    /* Set the end address for blank checking*/
    R_FACI_HP->FEADDR = (address + num_bytes) - 1U;

    /* Issue two part Blank Check command*/
    R_FACI_HP_CMD->FACI_CMD8 = FLASH_HP_FACI_CMD_BLANK_CHECK;
    R_FACI_HP_CMD->FACI_CMD8 = FLASH_HP_FACI_CMD_FINAL;

    /* If in DF BGO mode, exit here; remaining processing if any will be done in ISR */
    if (p_ctrl->p_cfg->data_flash_bgo == true)
    {
        p_ctrl->current_operation = FLASH_OPERATION_DF_BGO_BLANKCHECK;
        *p_blank_check_result     = FLASH_RESULT_BGO_ACTIVE;

