michaelthomasj/fsp_cmake/ra6m5_gcc_secure/ra/fsp/src/r_flash_hp/r_flash_hp.c
        return FSP_SUCCESS;
    }

    /* timeout_blank_check specifies the wait time for a 4 byte blank check,
     * num_bytes is divided by 4 and then multiplied to calculate the wait time for the entire operation*/

    /* Configure the timeout value. */
    uint32_t wait_count = (p_ctrl->timeout_blank_check * ((num_bytes >> 2) + 1));

    /* Wait for the operation to complete or timeout. If timeout stop the module and return error. */

    /* Read FRDY bit until it has been set to 1 indicating that the current
     * operation is complete. */
    while (1U != R_FACI_HP->FSTATR_b.FRDY)
    {
        /* Wait until FRDY is 1 unless timeout occurs. */
        if (wait_count == 0U)
        {
            err = FSP_ERR_TIMEOUT;
            break;
        }

        wait_count--;
    }

    /* Check the status of the Blank Check operation. */
    err = flash_hp_check_errors(err, 0, FSP_ERR_BLANK_CHECK_FAILED);

    /* Set the result to blank or not blank. */
    if (R_FACI_HP->FBCSTAT == 0x01U)
    {
        *p_blank_check_result = FLASH_RESULT_NOT_BLANK;
    }
    else
    {
        *p_blank_check_result = FLASH_RESULT_BLANK;
    }

    /* Return to read mode*/
    fsp_err_t pe_exit_err = flash_hp_pe_mode_exit();

    if (FSP_SUCCESS == err)
    {
        err = pe_exit_err;
    }

    /* Return status. */
    return err;
}

#endif

#if (FLASH_HP_CFG_DATA_FLASH_PROGRAMMING_ENABLE == 1) && (BSP_FEATURE_FLASH_SUPPORTS_ANTI_ROLLBACK == 1)

/*******************************************************************************************************************//**
 * This function converts the flash API counter enumeration to the register value for FCNTSELR
 *
 * @param counter The API counter value
 *
 * @returns FCNTSELR value
 **********************************************************************************************************************/
static uint8_t flash_hp_counter_to_fcntselr_convert (flash_arc_t counter)
{
    return (uint8_t) ((counter < FLASH_ARC_NSEC_0 ? counter + 1 : counter + 2) & R_FACI_HP_FCNTSELR_CNTSEL_Msk);
}

/*******************************************************************************************************************//**
 * This function reads the anti-rollback counter value
 *
 * ARC_OEMBL is read by FACI command because it is required to be read before increment to support RSIP-E51A comparison
 * by the FACI controller. The other counters are read by memory-mapped read.
 *
 * @param p_ctrl     Flash control block
 * @param fcntselr   FCNTSELR register value
 * @param p_count    The counter value
 *
 * @returns FCNTSELR value
 **********************************************************************************************************************/
static fsp_err_t flash_hp_arc_read (flash_hp_instance_ctrl_t * const p_ctrl, uint8_t fcntselr, uint32_t * const p_count)
{
    fsp_err_t           err;
    volatile uint32_t * p_src;
    uint32_t            counter_num_words;
    uint32_t            arc_oembl[2];

    switch (fcntselr)
    {
        case FLASH_HP_PRV_ARC_OEMBL_FCNTSELR:
        {
            err = flash_hp_arc_cmd_execute(p_ctrl, fcntselr, FLASH_HP_FACI_CMD_READ_COUNTER, p_ctrl->timeout_arc_read);
            FSP_ERROR_RETURN(FSP_SUCCESS == err, err);

            /* Read the counter values after successful FACI read command */
            arc_oembl[0] = R_FACI_HP->FCNTDATAR0;
            arc_oembl[1] = R_FACI_HP->FCNTDATAR1;

            p_src             = arc_oembl;
            counter_num_words = 2;
            break;
        }

        case FLASH_HP_PRV_ARC_SEC_FCNTSELR:
        {
            p_src             = R_OFS_DATAFLASH->ARC_SEC;
            counter_num_words = sizeof(R_OFS_DATAFLASH->ARC_SEC) / sizeof(R_OFS_DATAFLASH->ARC_SEC[0]);
            break;
        }

        default:                       // ARC_NSEC
        {
            uint8_t arcns = R_OFS_DATAFLASH->ARCCS_b.CNF_ARCNS;
            p_src = R_OFS_DATAFLASH->ARC_NSEC;

            if (FLASH_HP_PRV_ARCNS_MULTIPLE == arcns)
            {
                counter_num_words = BSP_FEATURE_FLASH_ARC_NSEC_MULTIPLE_MAX_COUNT >> 5; // bits to words
                uint32_t counter_index = ((uint32_t) fcntselr - FLASH_HP_PRV_ARC_NSEC_0_FCNTSELR) * counter_num_words;
                p_src = &R_OFS_DATAFLASH->ARC_NSEC[counter_index];
            }
            else if (FLASH_HP_PRV_ARCNS_SINGLE == arcns)
            {
                counter_num_words = sizeof(R_OFS_DATAFLASH->ARC_NSEC) / sizeof(R_OFS_DATAFLASH->ARC_NSEC[0]);
            }
            else
            {
                return FSP_ERR_NOT_ENABLED;
            }

            break;
        }
    }

    /* Determine the number of bits set in the counter data. This is the actual count value. */
    uint32_t count = 0;
    for (uint8_t word = 0; word < counter_num_words; word += 2)
    {
        uint32_t lo = p_src[word];
        uint32_t hi = p_src[1 + word];
        count += FLASH_HP_PRV_64_BITS - (__CLZ(hi) + __CLZ(lo));
    }

    *p_count = count;

    return FSP_SUCCESS;
}

/*******************************************************************************************************************//**
 * This function executes an anti-rollback counter FACI operation (read, refresh, or increment)
 *
 * @param[in]  p_ctrl                      Flash control block
 * @param[in]  fcntselr                    Register value to write to FCNTSELR to select the target counter
 * @param[in]  cmd                         The FACI command to use
 * @param[in] wait_count                   The command timeout
 *
 * @returns FCNTSELR value
 **********************************************************************************************************************/
static fsp_err_t flash_hp_arc_cmd_execute (flash_hp_instance_ctrl_t * const p_ctrl,
                                           uint8_t                          fcntselr,
                                           uint8_t                          cmd,
                                           volatile uint32_t                wait_count)
{
    /* Enter Data Flash P/E mode. If failure, return error */
    fsp_err_t err = flash_hp_enter_pe_df_mode(p_ctrl);
    FSP_ERROR_RETURN(FSP_SUCCESS == err, err);

    /* Select target counter */
    R_FACI_HP->FCNTSELR = fcntselr;

    /* Issue 2-part command to the FACI command-issuing area */
    R_FACI_HP_CMD->FACI_CMD8 = cmd;
    R_FACI_HP_CMD->FACI_CMD8 = FLASH_HP_FACI_CMD_FINAL;

    /* Wait for FRDY flag or timeout */
    while (1U != R_FACI_HP->FSTATR_b.FRDY)
    {
        if (wait_count == 0U)
        {
            err = FSP_ERR_TIMEOUT;
            break;
        }

