michaelthomasj/fsp_cmake/ra6m5_gcc_secure/ra/fsp/src/r_flash_hp/r_flash_hp.c
        wait_count--;
    }

    /* Check for errors and issue forced stop if error occurred */
    err = flash_hp_check_errors(err, 0, err);

    /* Return to read mode*/
    fsp_err_t pe_exit_err = flash_hp_pe_mode_exit();

    if (FSP_SUCCESS == err)
    {
        err = pe_exit_err;
    }

    return err;
}

#endif

/*******************************************************************************************************************//**
 * This function will initialize the FCU and set the FCU Clock based on the current FCLK frequency.
 * @param      p_ctrl        Pointer to the instance control block
 * @retval     FSP_SUCCESS   Clock and timeouts configured successfully.
 * @retval     FSP_ERR_FCLK  FCLK is not within the acceptable range.
 **********************************************************************************************************************/
static fsp_err_t flash_hp_init (flash_hp_instance_ctrl_t * p_ctrl)
{
    p_ctrl->current_operation = FLASH_OPERATION_NON_BGO;

    uint32_t flash_clock_freq_hz  = R_FSP_SystemClockHzGet(FSP_PRIV_CLOCK_FCLK);
    uint32_t system_clock_freq_hz = R_FSP_SystemClockHzGet(FSP_PRIV_CLOCK_ICLK);

#if !(BSP_FEATURE_FLASH_HP_VERSION == 4)

    /* Allow Access to the Flash registers*/
    R_SYSTEM->FWEPROR = 0x01U;
#endif

    FSP_ERROR_RETURN(flash_clock_freq_hz >= FLASH_HP_MINIMUM_SUPPORTED_FCLK_FREQ, FSP_ERR_FCLK);

    /* Round up the frequency to a whole number */
    uint32_t flash_clock_freq_mhz = (flash_clock_freq_hz + (FLASH_HP_FREQUENCY_IN_HZ - 1)) /
                                    FLASH_HP_FREQUENCY_IN_HZ;

    /* Round up the frequency to a whole number */
    uint32_t system_clock_freq_mhz = (system_clock_freq_hz + (FLASH_HP_FREQUENCY_IN_HZ - 1)) /
                                     FLASH_HP_FREQUENCY_IN_HZ;

#if BSP_FEATURE_FLASH_HP_VERSION == 4

    /* Enable the DataFlash if not already enabled */
    if (1U != R_FACI_LP->DFLCTL)
    {
        R_FACI_LP->DFLCTL = 1U;

        /* Wait for (tDSTOP) before reading from data flash.
         * Refer to the "Data flash STOP recovery time" in the "Data flash characteristics" table from the relevant hardware manual */
        r_flash_hp_delay_ns(FLASH_HP_WAIT_TDSTOP, system_clock_freq_mhz);
    }
#endif

    /* Set the Clock */
    R_FACI_HP->FPCKAR = (uint16_t) (FLASH_HP_FPCKAR_KEY + flash_clock_freq_mhz);

    /*  According to HW Manual the Max Programming Time for 256 bytes (ROM)
     *  is 15.8ms.  This is with a FCLK of 4MHz. The calculation below
     *  calculates the number of ICLK ticks needed for the timeout delay.
     */
    p_ctrl->timeout_write_cf = (uint32_t) (FLASH_HP_MAX_WRITE_CF_US * system_clock_freq_mhz) /
                               R_FLASH_HP_CYCLES_MINIMUM_PER_TIMEOUT_LOOP;

    /*  According to HW Manual the Max Programming Time for 4 bytes
     *  (Data Flash) is 3.8ms.  This is with a FCLK of 4MHz. The calculation
     *  below calculates the number of ICLK ticks needed for the timeout delay.
     */
    p_ctrl->timeout_write_df = (uint32_t) (FLASH_HP_MAX_WRITE_DF_US * system_clock_freq_mhz) /
                               R_FLASH_HP_CYCLES_MINIMUM_PER_TIMEOUT_LOOP;

    /*  According to HW Manual the Data Buffer Full time for 2 bytes
     *  is 2 usec.  This is with a FCLK of 4MHz. The calculation
     *  below calculates the number of ICLK ticks needed for the timeout delay.
     */
    p_ctrl->timeout_dbfull = (uint32_t) (FLASH_HP_MAX_DBFULL_US * system_clock_freq_mhz) /
                             R_FLASH_HP_CYCLES_MINIMUM_PER_TIMEOUT_LOOP;

    /*  According to HW Manual the Max Blank Check time for 4 bytes
     *  (Data Flash) is 84 usec.  This is with a FCLK of 4MHz. The calculation
     *  below calculates the number of ICLK ticks needed for the timeout delay.
     */
    p_ctrl->timeout_blank_check = (uint32_t) (FLASH_HP_MAX_BLANK_CHECK_US * system_clock_freq_mhz) /
                                  R_FLASH_HP_CYCLES_MINIMUM_PER_TIMEOUT_LOOP;

    /*  According to the device hardware manual the max timeout value when
     *  using the configuration set command is 515 ms (DF max timeout). This
     *  is with a FCLK of 4MHz. The calculation below calculates the number
     *  of ICLK ticks needed for the timeout delay.
     */
    p_ctrl->timeout_write_config = (uint32_t) (FLASH_HP_MAX_WRITE_CONFIG_US * system_clock_freq_mhz) /
                                   R_FLASH_HP_CYCLES_MINIMUM_PER_TIMEOUT_LOOP;

    /*  According to HW Manual the Max Erasure Time for a 64 byte Data Flash block is
     *  around 18ms.  This is with a FCLK of 4MHz. The calculation below
     *  calculates the number of ICLK ticks needed for the timeout delay.
     */
    p_ctrl->timeout_erase_df_block = (uint32_t) (FLASH_HP_MAX_ERASE_DF_BLOCK_US * system_clock_freq_mhz) /
                                     R_FLASH_HP_CYCLES_MINIMUM_PER_TIMEOUT_LOOP;

    /*  According to HW Manual the Max Erasure Time for a 32KB block is
     *  around 1040ms.  This is with a FCLK of 4MHz. The calculation below
     *  calculates the number of ICLK ticks needed for the timeout delay.
     */
    p_ctrl->timeout_erase_cf_large_block =
        (uint32_t) (FLASH_HP_MAX_ERASE_CF_LARGE_BLOCK_US * system_clock_freq_mhz) /
        R_FLASH_HP_CYCLES_MINIMUM_PER_TIMEOUT_LOOP;

    /*  According to HW Manual the Max Erasure Time for a 8KB block is
     *  around 260ms.  This is with a FCLK of 4MHz. The calculation below
     *  calculates the number of ICLK ticks needed for the timeout delay.
     */
    p_ctrl->timeout_erase_cf_small_block =
        (uint32_t) (FLASH_HP_MAX_ERASE_CF_SMALL_BLOCK_US * system_clock_freq_mhz) /
        R_FLASH_HP_CYCLES_MINIMUM_PER_TIMEOUT_LOOP;

#if (BSP_FEATURE_FLASH_SUPPORTS_ANTI_ROLLBACK == 1)

    /*  According to the device HW manual the max timeout value for
     *  refreshing or incrementing the anti-rollback counter is around 81 ms.
     *  This is with a FCLK of 4MHz. The calculation below  calculates the
     *  number of ICLK ticks needed for the timeout delay.
     */
    p_ctrl->timeout_arc_increment_refresh =
        (uint32_t) (FLASH_HP_MAX_INCREMENT_REFRESH_COUNTER_US * system_clock_freq_mhz) /
        R_FLASH_HP_CYCLES_MINIMUM_PER_TIMEOUT_LOOP;

    /*  According to the device HW manual the max timeout value for
     *  reading the anti-rollback counter is around 25 ms. This is with
     *  a FCLK of 4MHz. The calculation below  calculates the number of ICLK
     *  ticks needed for the timeout delay.
     */
    p_ctrl->timeout_arc_read =
        (uint32_t) (FLASH_HP_MAX_READ_COUNTER_US * system_clock_freq_mhz) /
        R_FLASH_HP_CYCLES_MINIMUM_PER_TIMEOUT_LOOP;
#endif

