michaelthomasj/fsp_cmake/ra6m5_gcc_secure/ra/fsp/src/r_flash_hp/r_flash_hp.c
    return FSP_SUCCESS;
}

#if BSP_FEATURE_FLASH_HP_VERSION == 4

/*******************************************************************************************************************//**
 * Delay for the given number of nano seconds at the given frequency
 *
 * @note This is used instead of R_BSP_SoftwareDelay because that may be linked in code flash.
 *
 * @param[in]  ns              Number of nanoseconds to delay
 * @param[in]  mhz             The frequency of the system clock
 **********************************************************************************************************************/
static void r_flash_hp_delay_ns (uint32_t ns, uint32_t mhz)
{
    uint32_t loop_cnt;

    /* @80 MHz, one loop is 12.5 ns. A delay of 250 ns would require 20 loops. 20 * 12.5 = 250 ns */

    /* Calculation of a loop count */
    loop_cnt = ((ns * mhz) / (FLASH_HP_DELAY_LOOP_CYCLES * FLASH_HP_DELAY_NS_PER_US));

    if (loop_cnt > 0U)
    {
        __asm volatile ("delay_loop:\n"
 #if defined(__ICCARM__) || defined(__ARMCC_VERSION) || (defined(__llvm__) && !defined(__CLANG_TIDY__))
                        "   subs %[loops_remaining], #1         \n"                 // 1 cycle
 #elif defined(__GNUC__)
                        "   sub %[loops_remaining], %[loops_remaining], #1      \n" // 1 cycle
 #endif
                        "cmp %[loops_remaining], #0\n"                              // 1 cycle

                        "   bne.n delay_loop \n"                                    // 2 cycles
                        :                                                           // No outputs
                        :[loops_remaining] "r" (loop_cnt)
                        :                                                           // No clobbers
                        );
    }
}

#endif

/*******************************************************************************************************************//**
 * Erase the block at the start address in the control block.
 *
 * @param      p_ctrl          Pointer to the instance control block
 * @param[in]  block_size      The block size
 * @param[in]  timeout         The timeout for the block erase
 *
 * @retval     FSP_SUCCESS     The erase completed successfully.
 * @retval     FSP_ERR_TIMEOUT The erase operation timed out.
 **********************************************************************************************************************/
static fsp_err_t flash_hp_erase_block (flash_hp_instance_ctrl_t * const p_ctrl, uint32_t block_size, uint32_t timeout)
{
    /* Set block start address*/
    R_FACI_HP->FSADDR = p_ctrl->source_start_address;

    /* Issue two part Block Erase commands */
    R_FACI_HP_CMD->FACI_CMD8 = FLASH_HP_FACI_CMD_BLOCK_ERASE;
    R_FACI_HP_CMD->FACI_CMD8 = FLASH_HP_FACI_CMD_FINAL;

    p_ctrl->source_start_address += block_size;

    p_ctrl->operations_remaining--;

    /* Wait until the operation has completed or timeout. If timeout stop the flash and return error. */

    /* Read FRDY bit until it has been set to 1 indicating that the current
     * operation is complete.*/
    if (timeout)
    {
        while (1U != R_FACI_HP->FSTATR_b.FRDY)
        {
            /* Wait until FRDY is 1 unless timeout occurs. */
            if (timeout == 0U)
            {
                return FSP_ERR_TIMEOUT;
            }

            timeout--;
        }
    }

    return FSP_SUCCESS;
}

#if (FLASH_HP_CFG_CODE_FLASH_PROGRAMMING_ENABLE == 1)

/*******************************************************************************************************************//**
 * This function erases a specified number of Code Flash blocks
 *
 * @param      p_ctrl                Pointer to the control block
 * @param[in]  block_address         The starting address of the first block to erase.
 * @param[in]  num_blocks            The number of blocks to erase.
 *
 * @retval     FSP_SUCCESS           Successfully erased (non-BGO) mode or operation successfully started (BGO).
 * @retval     FSP_ERR_ERASE_FAILED  Status is indicating a Erase error.
 * @retval     FSP_ERR_CMD_LOCKED    FCU is in locked state, typically as a result of attempting to Write or Erase an
 *                                   area that is protected by an Access Window.
 * @retval     FSP_ERR_TIMEOUT       Timed out waiting for the FCU to become ready.
 * @retval     FSP_ERR_PE_FAILURE    Failed to enter or exit Code Flash P/E mode.
 **********************************************************************************************************************/
static fsp_err_t flash_hp_cf_erase (flash_hp_instance_ctrl_t * p_ctrl, uint32_t block_address, uint32_t num_blocks)
{
    fsp_err_t err = FSP_SUCCESS;

    /* Set current operation parameters */
    p_ctrl->source_start_address = block_address;
    p_ctrl->operations_remaining = num_blocks;
    uint32_t wait_count;
    uint32_t block_size;

    err = flash_hp_enter_pe_cf_mode(p_ctrl);
    FSP_ERROR_RETURN(FSP_SUCCESS == err, err);

 #if !(BSP_FEATURE_FLASH_HP_VERSION == 4)

    /* Set Erasure Priority Mode*/
    R_FACI_HP->FCPSR = 1U;
 #endif

    while (p_ctrl->operations_remaining && (FSP_SUCCESS == err))
    {
        if ((p_ctrl->source_start_address & FLASH_HP_PRV_BANK1_MASK) < BSP_FEATURE_FLASH_HP_CF_REGION0_SIZE)
        {
            wait_count = p_ctrl->timeout_erase_cf_small_block;
            block_size = BSP_FEATURE_FLASH_HP_CF_REGION0_BLOCK_SIZE;
        }
        else
        {
            wait_count = p_ctrl->timeout_erase_cf_large_block;
            block_size = BSP_FEATURE_FLASH_HP_CF_REGION1_BLOCK_SIZE;
        }

        err = flash_hp_erase_block(p_ctrl, block_size, wait_count);

        /* Check the status of the erase operation. */
        err = flash_hp_check_errors(err, FLASH_HP_FSTATR_ERSERR | FLASH_HP_FSTATR_ILGLERR, FSP_ERR_ERASE_FAILED);
    }

    /* Return to read mode*/
    fsp_err_t pe_exit_err = flash_hp_pe_mode_exit();

    if (FSP_SUCCESS == err)
    {
        err = pe_exit_err;
    }

    return err;
}

#endif

#if (FLASH_HP_CFG_DATA_FLASH_PROGRAMMING_ENABLE == 1)

/*******************************************************************************************************************//**
 * This function erases a specified number of Code or Data Flash blocks
 *
 * @param      p_ctrl                Pointer to the control block
 * @param[in]  block_address         The starting address of the first block to erase.
 * @param[in]  num_blocks            The number of blocks to erase.
 *
 * @retval     FSP_SUCCESS           Successfully erased (non-BGO) mode or operation successfully started (BGO).
 * @retval     FSP_ERR_ERASE_FAILED  Status is indicating a Erase error.
 * @retval     FSP_ERR_CMD_LOCKED    FCU is in locked state, typically as a result of attempting to Write or Erase an
 *                                   area that is protected by an Access Window.
 * @retval     FSP_ERR_TIMEOUT       Timed out waiting for the FCU to become ready.
 * @retval     FSP_ERR_PE_FAILURE    Failed to enter or exit P/E mode.
 **********************************************************************************************************************/
static fsp_err_t flash_hp_df_erase (flash_hp_instance_ctrl_t * p_ctrl, uint32_t block_address, uint32_t num_blocks)
{
    fsp_err_t err = FSP_SUCCESS;

    /* Set current operation parameters */
    p_ctrl->source_start_address = block_address;
    p_ctrl->operations_remaining = num_blocks;
    uint32_t wait_count;

    err = flash_hp_enter_pe_df_mode(p_ctrl);
    FSP_ERROR_RETURN(FSP_SUCCESS == err, FSP_ERR_PE_FAILURE);

