michaelthomasj/fsp_cmake/ra6m5_gcc_secure/ra/fsp/src/r_flash_hp/r_flash_hp.c
        /* Configure the configuration area to be written. */
        flash_hp_configuration_area_data_setup(~swap_type & 0x1, faws, fawe);
 #else
        memset(g_configuration_area_data, UINT8_MAX, sizeof(g_configuration_area_data));

        g_configuration_area_data[FLASH_HP_FCU_CONFIG_SET_FAWE_BTFLG_OFFSET] =
            (uint16_t) (((((uint16_t) ~swap_type) & 0x1U) << 15U) | FLASH_HP_OFS_SAS_MASK);
 #endif

        /* Write the configuration area to the access/startup region. */
        err = flash_hp_configuration_area_write(p_ctrl,
                                                FLASH_HP_FCU_CONFIG_SET_ACCESS_STARTUP,
                                                g_configuration_area_data);

        err = flash_hp_check_errors(err, 0, FSP_ERR_WRITE_FAILED);
    }

    /* Return to read mode*/
    fsp_err_t pe_exit_err = flash_hp_pe_mode_exit();

    if (FSP_SUCCESS == err)
    {
        err = pe_exit_err;
    }

    return err;
}

#endif

#if (FLASH_HP_CFG_CODE_FLASH_PROGRAMMING_ENABLE == 1) && (BSP_FEATURE_FLASH_SUPPORTS_ID_CODE == 1)

/*******************************************************************************************************************//**
 * Set the ID code.
 *
 * @param      p_ctrl                Pointer to the control block
 * @param      p_id_code             The identifier code
 * @param[in]  mode                  ID code mode
 *
 * @retval     FSP_SUCCESS           Set Configuration successful
 * @retval     FSP_ERR_PE_FAILURE    Failed to enter or exit Code Flash P/E mode.
 * @retval     FSP_ERR_TIMEOUT       Timed out waiting for the FCU to become ready.
 * @retval     FSP_ERR_WRITE_FAILED  Status is indicating a Programming error for the requested operation.
 * @retval     FSP_ERR_CMD_LOCKED    FCU is in locked state, typically as a result of having received an illegal
 *                                   command.
 **********************************************************************************************************************/
static fsp_err_t flash_hp_set_id_code (flash_hp_instance_ctrl_t * p_ctrl,
                                       uint8_t const * const      p_id_code,
                                       flash_id_code_mode_t       mode)
{
    uint32_t * temp      = (uint32_t *) p_id_code;
    uint32_t * temp_area = (uint32_t *) g_configuration_area_data;

    /* Update Flash state and enter the required P/E mode specified by the hardware manual. */
    fsp_err_t err = flash_hp_enter_pe_cf_mode(p_ctrl);
    FSP_ERROR_RETURN(FSP_SUCCESS == err, err);

    /* Configure the configuration area to be written. If the mode is unlocked write all 0xFF. */
    for (uint32_t index = 0U; index < 4U; index++)
    {
        if (FLASH_ID_CODE_MODE_UNLOCKED == mode)
        {
            temp_area[index] = UINT32_MAX;
        }
        else
        {
            temp_area[index] = temp[index];
        }
    }

    /* If the mode is not unlocked set bits 126 and 127 accordingly. */
    if (FLASH_ID_CODE_MODE_UNLOCKED != mode)
    {
        g_configuration_area_data[FLASH_HP_CONFIG_SET_ACCESS_WORD_CNT_CF - 1U] |= (uint16_t) mode;
    }

    /* Write the configuration area to the access/startup region. */
    err = flash_hp_configuration_area_write(p_ctrl, FLASH_HP_FCU_CONFIG_SET_ID_BYTE, g_configuration_area_data);

    err = flash_hp_check_errors(err, 0, FSP_ERR_WRITE_FAILED);

    /* Return to read mode*/
    fsp_err_t pe_exit_err = flash_hp_pe_mode_exit();

    if (FSP_SUCCESS == err)
    {
        err = pe_exit_err;
    }

    return err;
}

#endif

#if (FLASH_HP_CFG_CODE_FLASH_PROGRAMMING_ENABLE == 1) || ((FLASH_HP_CFG_DATA_FLASH_PROGRAMMING_ENABLE == 1) && \
    (BSP_FEATURE_FLASH_USER_LOCKABLE_AREA_SIZE > 0))

/*******************************************************************************************************************//**
 * Execute the Configuration Set Command: sequence
 *
 * @param      p_ctrl           Pointer to the control block
 * @param[in]  fsaddr           Flash address to be written to.
 * @param[in]  src_address      Pointer to the data to write to the configuration area.
 *
 * @retval     FSP_SUCCESS      Configuration Set successful
 * @retval     FSP_ERR_TIMEOUT  Timed out waiting for the FCU to become ready.
 **********************************************************************************************************************/
static fsp_err_t flash_hp_configuration_area_write (flash_hp_instance_ctrl_t * p_ctrl,
                                                    uint32_t                   fsaddr,
                                                    uint16_t                 * src_address)
{
    volatile uint32_t timeout           = p_ctrl->timeout_write_config;
    uint8_t           faci_config_set_2 = FLASH_HP_FACI_CMD_CONFIG_SET_2_CF;
    uint32_t          access_word_count = FLASH_HP_CONFIG_SET_ACCESS_WORD_CNT_CF;

 #if (FLASH_HP_CFG_DATA_FLASH_PROGRAMMING_ENABLE == 1) && (BSP_FEATURE_FLASH_USER_LOCKABLE_AREA_SIZE > 0)
    if (fsaddr >= BSP_FEATURE_FLASH_USER_LOCKABLE_AREA_START)
    {
        faci_config_set_2 = FLASH_HP_FACI_CMD_CONFIG_SET_2_DF;
        access_word_count = FLASH_HP_CONFIG_SET_ACCESS_WORD_CNT_DF;
    }
 #endif

    /* See "Configuration Set Command" in the Flash Memory section of the relevant hardware manual. */
    R_FACI_HP->FSADDR        = fsaddr;
    R_FACI_HP_CMD->FACI_CMD8 = FLASH_HP_FACI_CMD_CONFIG_SET_1;
    R_FACI_HP_CMD->FACI_CMD8 = faci_config_set_2;

    /* Write the configuration data. */
    for (uint32_t index = 0U; index < access_word_count; index++)
    {
        /* There are 8 16 bit halfwords that must be written to accomplish a configuration set */
        R_FACI_HP_CMD->FACI_CMD16 = src_address[index];
    }

    R_FACI_HP_CMD->FACI_CMD8 = FLASH_HP_FACI_CMD_FINAL;

    while (1U != R_FACI_HP->FSTATR_b.FRDY)
    {
        if (timeout <= 0U)
        {
            return FSP_ERR_TIMEOUT;
        }

        timeout--;
    }

    return FSP_SUCCESS;
}

#endif

#if (((FLASH_HP_CFG_DATA_FLASH_PROGRAMMING_ENABLE == 1) && (BSP_FEATURE_FLASH_USER_LOCKABLE_AREA_SIZE > 0)) == 1)

/*******************************************************************************************************************//**
 * Write user data to the user lockable area
 *
 * @param     p_ctrl           Pointer to the control block
 * @param     src_address      Pointer to the data to write to the configuration area. Data length must a multiple of the
 *                             write size.
 * @param     flash_address    Flash address to be written to.
 * @param     num_bytes        Number of bytes to write. Must be a multiple of the write size.
 *
 * @retval     FSP_SUCCESS      Configuration Set successful
 * @retval     FSP_ERR_TIMEOUT  Timed out waiting for the FCU to become ready.
 **********************************************************************************************************************/
static fsp_err_t flash_hp_user_lockable_area_write (flash_hp_instance_ctrl_t * p_ctrl,
                                                    uint32_t const             src_address,
                                                    uint32_t                   flash_address,
                                                    uint32_t const             num_bytes)
{
    fsp_err_t err;
    err = flash_hp_enter_pe_df_mode(p_ctrl);
    FSP_ERROR_RETURN(FSP_SUCCESS == err, err);

