michaelthomasj/fsp_cmake/ra6m5_gcc_secure/ra/fsp/src/r_flash_hp/r_flash_hp.c
    uint32_t   operations_remaining = num_bytes / BSP_FEATURE_FLASH_HP_DF_WRITE_SIZE;
    uint16_t * p_src                = (uint16_t *) src_address;

    do
    {
        /* Write the minimum write size to the lockable area */
        err = flash_hp_configuration_area_write(p_ctrl, flash_address, p_src);

        /* Check for errors that may have occurred during the write */
        err = flash_hp_check_errors(err, 0, FSP_ERR_WRITE_FAILED);

        flash_address += BSP_FEATURE_FLASH_HP_DF_WRITE_SIZE;
        p_src         += BSP_FEATURE_FLASH_HP_DF_WRITE_SIZE / sizeof(p_src[0]);
        operations_remaining--;
    } while ((operations_remaining) && (err == FSP_SUCCESS));

    /* Return to read mode*/
    fsp_err_t pe_exit_err = flash_hp_pe_mode_exit();

    if (FSP_SUCCESS == err)
    {
        err = pe_exit_err;
    }

    return err;
}

#endif

/** If BGO is being used then we require both interrupts to be enabled (RDY and ERR). If either one
 *  is not enabled then don't generate any ISR routines */

/*******************************************************************************************************************//**
 * FLASH error interrupt routine.
 *
 * This function implements the FLASH error isr. The function clears the interrupt request source on entry populates the
 * callback structure with the FLASH_IRQ_EVENT_ERR_ECC event, and providing a callback routine has been provided, calls
 * the callback function with the event.
 **********************************************************************************************************************/
void fcu_fiferr_isr (void)
{
    /* Save context if RTOS is used */
    FSP_CONTEXT_SAVE
    flash_event_t event;
    IRQn_Type     irq = R_FSP_CurrentIrqGet();

    flash_hp_instance_ctrl_t * p_ctrl = (flash_hp_instance_ctrl_t *) R_FSP_IsrContextGet(irq);

    uint32_t fastat        = R_FACI_HP->FASTAT;
    uint32_t fstatr_errors = R_FACI_HP->FSTATR & FLASH_HP_FSTATR_ERROR_MASK;

    /* The flash access error interrupt register has fired. */
    /* Check for the data flash memory access violation flag. */
    if (fastat & FLASH_HP_FASTAT_DFAE)
    {
        event = FLASH_EVENT_ERR_DF_ACCESS;
    }
    /* Check for the code flash memory access violation flag. */
    else if (fastat & FLASH_HP_FASTAT_CFAE)
    {
        event = FLASH_EVENT_ERR_CF_ACCESS;
    }
    /* Check if the command Lock bit is set. */
    else if (fastat & FLASH_HP_FASTAT_CMDLK)
    {
        if (fstatr_errors & (FLASH_HP_FSTATR_PRGERR | FLASH_HP_FSTATR_ERSERR))
        {
            event = FLASH_EVENT_ERR_FAILURE;
        }
        else
        {
            event = FLASH_EVENT_ERR_CMD_LOCKED;
        }
    }
    else
    {
        event = FLASH_EVENT_ERR_FAILURE;
    }

    /* Reset the FCU: This will stop any existing processes and exit PE mode*/
    flash_hp_reset(p_ctrl);

    /* Clear the Error Interrupt. */
    R_BSP_IrqStatusClear(irq);

    /* Call the user callback. */
    r_flash_hp_call_callback(p_ctrl, event);

    /* Restore context if RTOS is used */
    FSP_CONTEXT_RESTORE
}

/*******************************************************************************************************************//**
 * FLASH ready interrupt routine.
 *
 * This function implements the FLASH ready isr. The function clears the interrupt request source on entry populates the
 * callback structure with the relevant event, and providing a callback routine has been provided, calls the callback
 * function with the event.
 **********************************************************************************************************************/
void fcu_frdyi_isr (void)
{
    FSP_CONTEXT_SAVE
    bool operation_completed = false;

    /*Wait counter used for DBFULL flag*/
    flash_event_t event;

    IRQn_Type irq = R_FSP_CurrentIrqGet();

    flash_hp_instance_ctrl_t * p_ctrl = (flash_hp_instance_ctrl_t *) R_FSP_IsrContextGet(irq);

    /* Clear the Interrupt Request*/
    R_BSP_IrqStatusClear(irq);

    /* A reset of the FACI with a BGO operation in progress may still generate a single interrupt
     * subsequent to the reset. We want to ignore that */

    /* Continue the current operation. If unknown operation set callback event to failure. */
    if (FLASH_OPERATION_DF_BGO_WRITE == p_ctrl->current_operation)
    {
        /* If there are still bytes to write */
        if (p_ctrl->operations_remaining)
        {
            fsp_err_t err = flash_hp_write_data(p_ctrl, BSP_FEATURE_FLASH_HP_DF_WRITE_SIZE, 0);

            if (FSP_SUCCESS != err)
            {
                flash_hp_reset(p_ctrl);
                event = FLASH_EVENT_ERR_FAILURE;
            }
        }
        /*Done writing all bytes*/
        else
        {
            event               = FLASH_EVENT_WRITE_COMPLETE;
            operation_completed = true;
        }
    }
    else if ((FLASH_OPERATION_DF_BGO_ERASE == p_ctrl->current_operation))
    {
        if (p_ctrl->operations_remaining)
        {
            flash_hp_erase_block(p_ctrl, BSP_FEATURE_FLASH_HP_DF_BLOCK_SIZE, 0);
        }
        /* If all blocks are erased*/
        else
        {
            event               = FLASH_EVENT_ERASE_COMPLETE;
            operation_completed = true;
        }
    }
    else
    {
        /* Blank check is a single operation */
        operation_completed = true;
        if (R_FACI_HP->FBCSTAT == 0x01U)
        {
            event = FLASH_EVENT_NOT_BLANK;
        }
        else
        {
            event = FLASH_EVENT_BLANK;
        }
    }

    /* If the current operation has completed exit pe mode, release the software lock and call the user callback if used. */
    if (operation_completed == true)
    {
        /* finished current operation. Exit P/E mode*/
        flash_hp_pe_mode_exit();

        /* Release lock and Set current state to Idle*/
        p_ctrl->current_operation = FLASH_OPERATION_NON_BGO;

        /* Set data to identify callback to user, then call user callback. */
        r_flash_hp_call_callback(p_ctrl, event);
    }

