michaelthomasj/fsp_cmake/ra6m5_gcc_secure/ra/fsp/src/r_flash_hp/r_flash_hp.c
    FSP_CONTEXT_RESTORE
}

/*******************************************************************************************************************//**
 * Calls user callback.
 *
 * @param[in]     p_ctrl     Pointer to FLASH_HP instance control block
 * @param[in]     event      Event code
 **********************************************************************************************************************/
static void r_flash_hp_call_callback (flash_hp_instance_ctrl_t * p_ctrl, flash_event_t event)
{
    flash_callback_args_t args;

    /* Store callback arguments in memory provided by user if available.  This allows callback arguments to be
     * stored in non-secure memory so they can be accessed by a non-secure callback function. */
    flash_callback_args_t * p_args = p_ctrl->p_callback_memory;
    if (NULL == p_args)
    {
        /* Store on stack */
        p_args = &args;
    }
    else
    {
        /* Save current arguments on the stack in case this is a nested interrupt. */
        args = *p_args;
    }

    p_args->event     = event;
    p_args->data      = 0U;
    p_args->p_context = p_ctrl->p_context;

#if BSP_TZ_SECURE_BUILD

    /* p_callback can point to a secure function or a non-secure function. */
    if (!cmse_is_nsfptr(p_ctrl->p_callback))
    {
        /* If p_callback is secure, then the project does not need to change security state. */
        p_ctrl->p_callback(p_args);
    }
    else
    {
        /* If p_callback is Non-secure, then the project must change to Non-secure state in order to call the callback. */
        flash_hp_prv_ns_callback p_callback = (flash_hp_prv_ns_callback) (p_ctrl->p_callback);
        p_callback(p_args);
    }

#else

    /* If the project is not Trustzone Secure, then it will never need to change security state in order to call the callback. */
    p_ctrl->p_callback(p_args);
#endif
    if (NULL != p_ctrl->p_callback_memory)
    {
        /* Restore callback memory in case this is a nested interrupt. */
        *p_ctrl->p_callback_memory = args;
    }
}

/*******************************************************************************************************************//**
 * This function switches the peripheral to P/E mode for Data Flash.
 * @param[in]  p_ctrl              Pointer to the Flash control block.
 * @retval     FSP_SUCCESS         Successfully entered Data Flash P/E mode.
 * @retval     FSP_ERR_PE_FAILURE  Failed to enter Data Flash P/E mode.
 **********************************************************************************************************************/
static fsp_err_t flash_hp_enter_pe_df_mode (flash_hp_instance_ctrl_t * const p_ctrl)
{
    fsp_err_t err = FSP_SUCCESS;

    /* See "Transition to Data Flash P/E Mode" in the Flash Memory section of the relevant hardware manual. */
    /* Timeout counter. */
    volatile uint32_t wait_count = FLASH_HP_FRDY_CMD_TIMEOUT;

    /* If BGO mode is enabled and interrupts are being used then enable interrupts. */
    if (p_ctrl->p_cfg->data_flash_bgo == true)
    {
        /* We are supporting Flash Rdy interrupts for Data Flash operations. */
        R_BSP_IrqEnable(p_ctrl->p_cfg->irq);

        /* We are supporting Flash Err interrupts for Data Flash operations. */
        R_BSP_IrqEnable(p_ctrl->p_cfg->err_irq);
    }

    /* Enter Data Flash PE mode. */
    R_FACI_HP->FENTRYR = FLASH_HP_FENTRYR_TRANSITION_TO_DF_PE;

    /* Wait for the operation to complete or timeout. If timeout return error. */
    /* Read FENTRYR until it has been set to 0x0080 indicating that we have successfully entered P/E mode.*/
    while (FLASH_HP_FENTRYR_DF_PE_MODE != R_FACI_HP->FENTRYR)
    {
        /* Wait until FENTRYR is 0x0080 unless timeout occurs. */
        if (wait_count == 0U)
        {

            /* if FENTRYR is not set after max timeout return an error. */
            return FSP_ERR_PE_FAILURE;
        }

        wait_count--;
    }

    return err;
}

#if (FLASH_HP_CFG_CODE_FLASH_PROGRAMMING_ENABLE == 1)

/*******************************************************************************************************************//**
 * This function switches the peripheral to P/E mode for Code Flash.
 * @param[in]  p_ctrl              Pointer to the Flash control block.
 * @retval     FSP_SUCCESS         Successfully entered Code Flash P/E mode.
 * @retval     FSP_ERR_PE_FAILURE  Failed to enter Code Flash P/E mode.
 **********************************************************************************************************************/
static fsp_err_t flash_hp_enter_pe_cf_mode (flash_hp_instance_ctrl_t * const p_ctrl)
{
    fsp_err_t err = FSP_SUCCESS;

    /* See "Transition to Code Flash P/E Mode" in the Flash Memory section of the relevant hardware manual. */
    /* Timeout counter. */
    volatile uint32_t wait_count = FLASH_HP_FRDY_CMD_TIMEOUT;

    /* While the Flash API is in use we will disable the flash cache. */
 #if BSP_FEATURE_FLASH_HP_FCACHE_DISABLE_BEFORE_PE

    /* Disable the FCACHE, except for Star/RA40MCU devices that have errata. */
    R_FCACHE->FCACHEE = 0U;
 #endif

 #if defined(R_CACHE)

    /* Disable the C-Cache. */
    R_CACHE->CCACTL = 0U;
 #endif
 #if BSP_FEATURE_FLASH_PREFETCH_BUFFER
    R_FACI_LP->PFBER = 0U;
 #endif

    /* If interrupts are being used then disable interrupts. */
    if (p_ctrl->p_cfg->data_flash_bgo == true)
    {
        /* We are not supporting Flash Rdy interrupts for Code Flash operations */
        R_BSP_IrqDisable(p_ctrl->p_cfg->irq);

        /* We are not supporting Flash Err interrupts for Code Flash operations */
        R_BSP_IrqDisable(p_ctrl->p_cfg->err_irq);
    }

 #if BSP_FEATURE_FLASH_HP_HAS_FMEPROT
    R_FACI_HP->FMEPROT = FLASH_HP_FMEPROT_UNLOCK;
 #endif

    /* Enter code flash PE mode */
    R_FACI_HP->FENTRYR = FLASH_HP_FENTRYR_TRANSITION_TO_CF_PE;

    /* Wait for the operation to complete or timeout. If timeout return error. */
    /* Read FENTRYR until it has been set to 0x0001 indicating that we have successfully entered CF P/E mode.*/
    while (FLASH_HP_FENTRYR_CF_PE_MODE != R_FACI_HP->FENTRYR)
    {
        /* Wait until FENTRYR is 0x0001UL unless timeout occurs. */
        if (wait_count == 0U)
        {

            /* if FENTRYR is not set after max timeout, FSP_ERR_PE_FAILURE*/
            return FSP_ERR_PE_FAILURE;
        }

        wait_count--;
    }

    return err;
}

#endif
